{
    "count": 5,
    "pathways": [
        {
            "pathway_id": "b428ab364e313f48e4ef363f2a3e291a49bbbe560752f72cb74e50837f76ac69",
            "courses": {
                "1": [
                    {
                        "course_name": "HD4010",
                        "dept_abv": "HD",
                        "course_title": "Empirical Research",
                        "course_desc": "For study that predominantly involves data collection and analysis or laboratory or studio projects.",
                        "course_credits": 1.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/HD/4010'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "PSYCH1101",
                        "dept_abv": "PSYCH",
                        "course_title": "Introduction to Psychology",
                        "course_desc": "Why are people superstitious?  Why do people blush when they are embarrassed?  What is intelligence (and are IQ tests a good way to measure it)?  Why don't psychopaths feel guilty when they harm others?  How reliable are childhood memories?  Why do we laugh?  Do violent video games make people act violently?  Why do some people seem instantly trustworthy and others seem \"creepy\"?  How do we choose whom to sleep with, date, or marry?  How does stress affect our body?  While questions like these have been asked for centuries, psychology has begun to provide answers to these--and other questions about the human mind--by applying the tools of scientific investigation. In this course you will receive a broad introduction to the science of psychology: from the history of the field and its major advances, to the latest research on topics such as perception, memory, intelligence, morality, sexuality, mental illness, religion, language, and creativity.  You will also learn about the tools and methods psychologists use to investigate the mind, such as observing how the mind of a child changes and develops over time, looking at people across cultures, measuring brain activity, and experimentally manipulating everything from the shape of a figure presented on a computer screen, to the smell of a room, or the attractiveness of the experimenter.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/PSYCH/1101'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "HD1160",
                        "dept_abv": "HD",
                        "course_title": "Section for Infancy and Childhood",
                        "course_desc": "Provides an opportunity to discuss material in more depth in a small group. Students learn to read and critique empirical research articles and discuss the application and policy implications of course topics.",
                        "course_credits": 1.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA17/class/HD/1160'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "LING1100",
                        "dept_abv": "LING",
                        "course_title": "FWS: Language, Thought, and Reality",
                        "course_desc": "In this course the students learn the skill of writing at the university level. Instructors offer themes for their courses within their own special areas of expertise.  ",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/LING/1100'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "PE1545",
                        "dept_abv": "PE",
                        "course_title": "Beginning Figure Skating",
                        "course_desc": "No previous instruction necessary. Students will learn basic forward skating and balance and then learn a variety of skating skills including backward skating, stops, crossovers, turns, edges and some beginning spins and jumps. Skate rental available for $2.00 per session.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/PE/1545'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "HD1150",
                        "dept_abv": "HD",
                        "course_title": "Human Development: Infancy and Childhood",
                        "course_desc": "Introduces students to the basic concepts, theories, and research in human development as they explain prenatal development and development in infancy and childhood, including physical, cognitive, and social/emotional development. The focus is on individual development from an interdisciplinary perspective with an emphasis on psychological development, but also drawing from the fields of sociology, history, biology, anthropology, neuroscience, and education.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/HD/1150'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "CHEM2070",
                        "dept_abv": "CHEM",
                        "course_title": "General Chemistry I",
                        "course_desc": "Covers fundamental chemical principles, with considerable attention given to the quantitative aspects and techniques important for further work in chemistry.",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/CHEM/2070'",
                        "semester_taken": "2014FA"
                    }
                ],
                "2": [
                    {
                        "course_name": "HD4010",
                        "dept_abv": "HD",
                        "course_title": "Empirical Research",
                        "course_desc": "For study that predominantly involves data collection and analysis or laboratory or studio projects.",
                        "course_credits": 1.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/HD/4010'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "CHEM2080",
                        "dept_abv": "CHEM",
                        "course_title": "General Chemistry II",
                        "course_desc": "Covers fundamental chemical principles, including reaction kinetics, thermodynamics, and equilibrium. These principles are presented quantitatively and explored in the laboratory. Considerable attention is given to the quantitative calculations and techniques important for further work in chemistry.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/CHEM/2080'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "BIOG1440",
                        "dept_abv": "BIOG",
                        "course_title": "Introductory Biology: Comparative Physiology",
                        "course_desc": "An introductory physiology course intended for freshman and sophomore biology majors and other students majoring in life sciences. The course integrates physiology from the cell to the organism with comparisons among animals, plants and microbes. Emphasis is on understanding of basic physiological concepts, stressing structure-function relationships and underlying physio-chemical mechanisms.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOG/1440'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "PE1170",
                        "dept_abv": "PE",
                        "course_title": "Introduction to Swing Dance",
                        "course_desc": "Swing dance is not only popular but one of the most accessible and versatile dances you can learn. You will learn both East Coast Swing (also called Jitterbug), danced to Big Band, Swing and Rock-n-Roll, and West Coast Swing, which is a contemporary dance for a wide range of music from Michael Jackson to hip hop, and pop to R&amp;B. The class will focus on developing the underlying technique that creates the \"good physics\" of effortless dance, such as footwork, timing, alignment, partnering skills, &amp; musicality. Participants change partners during class. No dance experience or partner necessary. Shoes: leather soles OR white-soled sneakers with the treads worn smooth OR dance in socks.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/PE/1170'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "COGST1101",
                        "dept_abv": "COGST",
                        "course_title": "Introduction to Cognitive Science",
                        "course_desc": "This course provides an introduction to the science of the mind.  Everyone knows what it's like to think and perceive, but this subjective experience provides little insight into how minds emerge from physical intities like brains.  To address this issue, cognitive science integrates work from at least five disciplines: Psychology, Neuroscience, Computer Science, Linguistics, and Philosophy.  This course introduces students to the insights these disciplines offer into the workings of the mind by exploring visual perception, attention, memory, learning, problem solving, language, and consciousness. ",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/COGST/1101'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "MATH1120",
                        "dept_abv": "MATH",
                        "course_title": "Calculus II",
                        "course_desc": "Focuses on integration: applications, including volumes and arc length; techniques of integration, approximate integration with error estimates, improper integrals, differential equations (separation of variables, initial conditions, systems, some applications). Also covers infinite sequences and series: definition and tests for convergence, power series, Taylor series with remainder, and parametric equations.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/MATH/1120'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "BIOG1500",
                        "dept_abv": "BIOG",
                        "course_title": "Investigative Biology Laboratory",
                        "course_desc": "Designed for biology majors to provide lab experience with emphasis on processes of scientific investigations and to promote communication, literacy and collaboration in science. Students gain expertise in methods including instrumentation used by biologists to construct new knowledge. Lab topics include genetics, evolution, ecology, biochemistry, and molecular biology.",
                        "course_credits": 2.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOG/1500'",
                        "semester_taken": "2015SP"
                    }
                ],
                "3": [
                    {
                        "course_name": "CHEM3570",
                        "dept_abv": "CHEM",
                        "course_title": "Organic Chemistry for the Life Sciences",
                        "course_desc": "Study of the important classes of carbon compounds-including those encountered in the biological sciences. The course emphasizes their three-dimensional structures, mechanisms of their characteristic reactions, their synthesis, methods of identifying them, and their role in modern science and technology.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/CHEM/3570'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "HD4010",
                        "dept_abv": "HD",
                        "course_title": "Empirical Research",
                        "course_desc": "For study that predominantly involves data collection and analysis or laboratory or studio projects.",
                        "course_credits": 1.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/HD/4010'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "AEM2100",
                        "dept_abv": "AEM",
                        "course_title": "Introductory Statistics",
                        "course_desc": "Introduces statistical methods. Topics include the descriptive analysis of data, probability concepts and distributions, estimation and hypothesis testing, regression, and correlation analysis. Includes an introduction to Minitab, a statistical software package.",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/2100'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "PHYS1101",
                        "dept_abv": "PHYS",
                        "course_title": "General Physics I",
                        "course_desc": "PHYS 1101 and PHYS 1102 emphasize both quantitative and conceptual understanding of the topics and tools of introductory physics developed without the use of calculus. The courses offer individualized instruction. Students learn through completing assigned readings, problems, and laboratory exercises, and through individualized tutoring. Additionally, recorded lectures, overview sessions, short videos, sample tests, and online tutorials are provided. The course format provides flexibility, but in some ways is more demanding than a course with a traditional format. Success requires discipline and well-developed study habits. Students without high school physics should allow extra time. Evaluation includes an oral lab check, a selection of graded homework problems, and a written test for each unit; these must be completed within a flexible set of deadlines. Major topics for PHYS 1101: forces and equilibrium, kinematics, dynamics, momentum, energy, fluid mechanics, waves and sound, thermal physics, and thermodynamics. At the level of College Physics vol. 1, 4th ed., by Giambattista, Richardson, and Richardson.",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/PHYS/1101'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "BIONB2210",
                        "dept_abv": "BIONB",
                        "course_title": "Neurobiology and Behavior I: Introduction to Behavior",
                        "course_desc": "General introduction to the field of animal behavior. Topics include evolution and behavior, behavioral ecology, sociobiology, chemical ecology, communication, orientation and navigation.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/BIONB/2210'",
                        "semester_taken": "2015FA"
                    }
                ],
                "4": [
                    {
                        "course_name": "HD4010",
                        "dept_abv": "HD",
                        "course_title": "Empirical Research",
                        "course_desc": "For study that predominantly involves data collection and analysis or laboratory or studio projects.",
                        "course_credits": 1.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/HD/4010'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "BIOMG1350",
                        "dept_abv": "BIOMG",
                        "course_title": "Introductory Biology: Cell and Developmental Biology",
                        "course_desc": "The course introduces molecular mechanisms that underlie the organization, division, and growth of individual cells; how they organize during embryonic development to form functional tissues and organs in multicellular organisms; and how their misbehavior contributes to disease. Students seeking additional help with the material taught in BIOMG 1350 should consider the active learning supplemental class BIOMG 1035 (see course catalog for details). The learning outcomes below indicate the topics and skills that students should master upon completion of the course.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOMG/1350'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "PHYS1102",
                        "dept_abv": "PHYS",
                        "course_title": "General Physics II",
                        "course_desc": "PHYS 1101 and PHYS 1102 emphasize both quantitative and conceptual understanding of the topics and tools of introductory physics developed without the use of calculus. The courses offer individualized instruction. Students learn through completing assigned readings, problems, and laboratory exercises, and through individualized tutoring. Additionally, recorded lectures, overview sessions, short videos, sample tests, and online tutorials are provided. The course format provides flexibility, but in some ways is more demanding than a course with a traditional format. Success requires discipline and well-developed study habits. Students without high school physics should allow extra time. Evaluation includes an oral lab check, a selection of graded homework problems, and a written test for each unit; these must be completed within a flexible set of deadlines. Major topics for PHYS 1102: electric and magnetic forces and fields, electric currents and circuits, electromagnetic induction, alternating current, electromagnetic waves, optics, interference and diffraction, relativity, quantum physics, and nuclear physics. At the level of College Physics vol. 2, 4th ed., by Giambattista, Richardson, and Richardson.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/PHYS/1102'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "BIONB2220",
                        "dept_abv": "BIONB",
                        "course_title": "Neurobiology and Behavior II: Introduction to Neuroscience",
                        "course_desc": "An introduction to neuroscience: the structure and function of the nervous system of humans and other animals. Topics include the cellular and molecular basis for cell signaling, the functions of neurons in communication and in decision making; neuroanatomy, neurochemistry, sensory systems, motor systems, neural development, learning and memory, and other complex brain functions. The course will emphasize how the nervous system is built during development, how it changes with experiences during life, how it functions in normal behavior, and how it is disrupted by injury and disease. Discussion sections will include a dissection of a preserved sheep brain.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIONB/2220'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "BIOG4990",
                        "dept_abv": "BIOG",
                        "course_title": "Independent Undergraduate Research in Biology",
                        "course_desc": "For students with previous undergraduate experience conducting biological research at Cornell. Students enrolled for this credit should be doing independent work on their own project. Applications available online. Research supervisors must approve by the Add Deadline, two weeks after the start of classes. Each student must submit a project description as part of the application. Any Cornell faculty member whose research field is biological in nature may serve as supervisor for this course. Non-Cornell supervisors are not acceptable.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOG/4990'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "PE1290",
                        "dept_abv": "PE",
                        "course_title": "Introduction to Gymnastics",
                        "course_desc": "This class is an introduction to all of the men's and women's gymnastics events. Instruction will focus on beginner level skills with emphasis on tumbling and acrobatics. No experience is necessary and all ability levels are welcome. Students must have a basic level of fitness and upper body strength.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/PE/1290'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "CHEM3580",
                        "dept_abv": "CHEM",
                        "course_title": "Organic Chemistry for the Life Sciences",
                        "course_desc": "Study of the important classes of carbon compounds-including those encountered in the biological sciences. The course emphasizes their three-dimensional structures, mechanisms of their characteristic reactions, their synthesis, methods of identifying them, and their role in modern science and technology.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/CHEM/3580'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "CS1142",
                        "dept_abv": "CS",
                        "course_title": "Introduction to MATLAB",
                        "course_desc": "Introduction to elementary computer programming concepts using MATLAB. Topics include problem analysis, development of algorithms, selection, iteration, functions, and arrays. Examples and assignments are chosen to build an appreciation for computational science. The goal is for each student to develop a facility with MATLAB that will be useful in other courses whenever there is a need for computer problem solving or visualization.",
                        "course_credits": 2.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP17/class/CS/1142'",
                        "semester_taken": "2016SP"
                    }
                ],
                "5": [
                    {
                        "course_name": "BIOG4990",
                        "dept_abv": "BIOG",
                        "course_title": "Independent Undergraduate Research in Biology",
                        "course_desc": "For students with previous undergraduate experience conducting biological research at Cornell. Students enrolled for this credit should be doing independent work on their own project. Applications available online. Research supervisors must approve by the Add Deadline, two weeks after the start of classes. Each student must submit a project description as part of the application. Any Cornell faculty member whose research field is biological in nature may serve as supervisor for this course. Non-Cornell supervisors are not acceptable.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOG/4990'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "ENGL2800",
                        "dept_abv": "ENGL",
                        "course_title": "Creative Writing",
                        "course_desc": "An introductory course in the theory, practice, and reading of fiction, poetry, and allied forms. Both narrative and verse readings are assigned. Students will learn to savor and practice the craft of poetry and narrative writing, developing techniques that inform both. Some class meetings may feature peer review of student work, and instructors may assign writing exercises or prompts.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/ENGL/2800'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "BIOMG3310",
                        "dept_abv": "BIOMG",
                        "course_title": "Principles of Biochemistry: Proteins and Metabolism",
                        "course_desc": "The chemical reactions important to biology, and the enzymes that catalyze these reactions, are discussed in an integrated format. Topics include: protein folding, enzyme catalysis, bioenergetics, and key reactions of synthesis and catabolism.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/BIOMG/3310'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "BIOMG2800",
                        "dept_abv": "BIOMG",
                        "course_title": "Lectures in Genetics and Genomics",
                        "course_desc": "General introduction to the fundamental principles of genetics in eukaryotes and bacteria. Topics include: gene transmission, linkage, recombination, structure, mutations, and manipulation, as well as analysis of genomes in individuals and populations.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOMG/2800'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "BIONB4980",
                        "dept_abv": "BIONB",
                        "course_title": "Teaching Experience",
                        "course_desc": "Designed to give qualified undergraduate students teaching experience through actual involvement in planning and assisting in biology courses.  This experience may include supervised participation in a discussion group, assisting in a biology laboratory, assisting in field biology, or tutoring.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIONB/4980'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "BIONB3950",
                        "dept_abv": "BIONB",
                        "course_title": "Molecular and Genetic Approaches to Neuroscience",
                        "course_desc": "Focuses on how different molecular and genetic approaches have led to major advances in neuroscience. Lectures, student presentations, and discussions examine original research articles. Topics include ligand-gated channels, potassium channels, seven membrane spanning receptors, olfaction, pain and cold receptors, neurotransmitter release, neural networks, epilepsy, optogenetics, and circadian rhythms.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/BIONB/3950'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "BIOMG2801",
                        "dept_abv": "BIOMG",
                        "course_title": "Laboratory in Genetics and Genomics",
                        "course_desc": "General introduction to laboratory experimental genetics.  Topics include gene transmission, linkage, recombination, gene structure, mutations, and manipulation. ",
                        "course_credits": 2.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOMG/2801'",
                        "semester_taken": "2016FA"
                    }
                ],
                "6": [
                    {
                        "course_name": "BIOEE1780",
                        "dept_abv": "BIOEE",
                        "course_title": "An Introduction to Evolutionary Biology and Diversity",
                        "course_desc": "Considers explanations for pattern of diversity and the apparent good fit of organisms to the environment. Topics include the diversity of life, the genetics and developmental basis of evolutionary change, processes at the population level, evolution by natural selection, modes of speciation, long-term trends in evolution, origin of humans.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOEE/1780'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "CHEM2510",
                        "dept_abv": "CHEM",
                        "course_title": "Introduction to Experimental Organic Chemistry",
                        "course_desc": "Introduction to the synthesis, separation, characterization, and handling of materials, including the applications of different types of chromatography, extraction, crystallization, infrared spectroscopy, polarimetry, and others. An experiment is performed the first week of lab and to prepare for this lab students need to enroll in the course Canvas site and complete the appropriate pre-lab assignments outlined on that site before coming to the first lab.",
                        "course_credits": 2.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/CHEM/2510'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "BIONB3280",
                        "dept_abv": "BIONB",
                        "course_title": "Biopsychology of Learning and Memory",
                        "course_desc": "Surveys the approaches that have been or are currently being used in order to understand the biological bases for learning and memory. Topics include invertebrate, \"simple system\" approaches, avian song learning, hippocampal and cerebellar function, research using MRI in humans. Many of the readings are from primary literature.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIONB/3280'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "SOC3130",
                        "dept_abv": "BSOC",
                        "course_title": "Sociology of Medicine",
                        "course_desc": "This course provides an introduction to the ways in which medical practice, the medical profession, and medical technology are embedded in society and culture. We will ask how medicine is connected to various sociocultural factors such as gender, social class, race, and administrative cultures. We will examine the rise of medical sociology as a discipline, the professionalization of medicine, and processes of medicalization and demedicalization. We will look at alternative medical practices and how they differ from and converge with the dominant medical paradigm. We will focus on the rise of medical technology in clinical practice with a special emphases on reproductive technologies. We will focus on the body as a site for medical knowledge, including the medicalization of sex differences, the effect of culture on nutrition, and eating disorders such as obesity and anorexia nervosa. We will also read various classic and contemporary texts that speak to the illness experience and the culture of surgeons, hospitals, and patients, and we will discuss various case studies in the social construction of physical and mental illness.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/BSOC/3111'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "BIOMG3320",
                        "dept_abv": "BIOMG",
                        "course_title": "Principles of Biochemistry: Molecular Biology",
                        "course_desc": "Comprehensive course in molecular biology that covers the structure and properties of DNA, DNA replication and repair, synthesis and processing of RNA and proteins, the regulation of gene expression, and the principles and applications of recombinant DNA technologies, genomics, and proteomics.",
                        "course_credits": 2.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOMG/3320'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "BIOG4990",
                        "dept_abv": "BIOG",
                        "course_title": "Independent Undergraduate Research in Biology",
                        "course_desc": "For students with previous undergraduate experience conducting biological research at Cornell. Students enrolled for this credit should be doing independent work on their own project. Applications available online. Research supervisors must approve by the Add Deadline, two weeks after the start of classes. Each student must submit a project description as part of the application. Any Cornell faculty member whose research field is biological in nature may serve as supervisor for this course. Non-Cornell supervisors are not acceptable.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOG/4990'",
                        "semester_taken": "2017SP"
                    }
                ],
                "7": [
                    {
                        "course_name": "BIOG4990",
                        "dept_abv": "BIOG",
                        "course_title": "Independent Undergraduate Research in Biology",
                        "course_desc": "For students with previous undergraduate experience conducting biological research at Cornell. Students enrolled for this credit should be doing independent work on their own project. Applications available online. Research supervisors must approve by the Add Deadline, two weeks after the start of classes. Each student must submit a project description as part of the application. Any Cornell faculty member whose research field is biological in nature may serve as supervisor for this course. Non-Cornell supervisors are not acceptable.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOG/4990'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "BIONB3920",
                        "dept_abv": "BIONB",
                        "course_title": "Drugs and the Brain",
                        "course_desc": "Introduction to neuropharmacology, with an emphasis on the neural mechanisms of psychoactive drugs. Topics include a brief introduction to neuropharmacology and a discussion of the major neurotransmitter families. The rest of the course covers the major psychoactive drugs, including cocaine, heroin, psychedelics, marijuana, and alcohol, as well as pharmaceuticals for the treatment of anxiety, schizophrenia, and depression. Includes a term paper in the form of a grant proposal to study a current problem in neuropharmacology. The course will use i-Clickers, which the students should have before the first class. BIONB3920 website",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/BIONB/3920'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "BIONB3240",
                        "dept_abv": "BIONB",
                        "course_title": "Behavioral Neuroscience Laboratory",
                        "course_desc": "This course is designed to provide an introduction to experimental research on the neural basis of behavior and cognition in animals. Topics will include basic neuroanatomy and neurophysiology, neural and hormonal control of behavior, and learning and memory. Students will gain extensive hands on experience with a variety of laboratory techniques, and animal species, and behaviors.",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/BIONB/3240'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "BIONB4980",
                        "dept_abv": "BIONB",
                        "course_title": "Teaching Experience",
                        "course_desc": "Designed to give qualified undergraduate students teaching experience through actual involvement in planning and assisting in biology courses.  This experience may include supervised participation in a discussion group, assisting in a biology laboratory, assisting in field biology, or tutoring.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIONB/4980'",
                        "semester_taken": "2017FA"
                    }
                ],
                "8": [
                    {
                        "course_name": "PE1546",
                        "dept_abv": "PE",
                        "course_title": "Intermediate Figure Skating",
                        "course_desc": "Students in this class should have some previous experience (ability to skate forward and backward). The course will begin with basic forward and backward skating and quickly go through all the same skills taught in the intro course. Students will then learn some more difficult turns, jumps and spins. Skate rental available for $2.00 per session.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/PE/1546'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "BIONB4550",
                        "dept_abv": "BIONB",
                        "course_title": "Molecular and Neural Basis of Decision Making",
                        "course_desc": "This course will examine the neural and molecular mechanisms of decision making across a variety of animal species and humans. The course involves the critical reading and discussion of classic and contemporary papers in this subject. Topics will include the neural mechanisms of motivation, attention, working memory, risk taking and neuroeconomics.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/BIONB/4550'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "BIOG4990",
                        "dept_abv": "BIOG",
                        "course_title": "Independent Undergraduate Research in Biology",
                        "course_desc": "For students with previous undergraduate experience conducting biological research at Cornell. Students enrolled for this credit should be doing independent work on their own project. Applications available online. Research supervisors must approve by the Add Deadline, two weeks after the start of classes. Each student must submit a project description as part of the application. Any Cornell faculty member whose research field is biological in nature may serve as supervisor for this course. Non-Cornell supervisors are not acceptable.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOG/4990'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "BIONB4980",
                        "dept_abv": "BIONB",
                        "course_title": "Teaching Experience",
                        "course_desc": "Designed to give qualified undergraduate students teaching experience through actual involvement in planning and assisting in biology courses.  This experience may include supervised participation in a discussion group, assisting in a biology laboratory, assisting in field biology, or tutoring.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIONB/4980'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "ENGL2890",
                        "dept_abv": "ENGL",
                        "course_title": "Expository Writing",
                        "course_desc": "This course offers guidance and an audience for students who wish to gain skill in expository writing—a common term for critical, reflective, investigative, and creative nonfiction. Each section provides a context for writing defined by a form of exposition, a disciplinary area, a practice, or a topic intimately related to the written medium. Course members will read in relevant published material and write and revise their own work regularly, while reviewing and responding to one another's. Students and instructors will confer individually throughout the term. Topics differ for each section.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ENGL/2890'",
                        "semester_taken": "2018SP"
                    }
                ]
            }
        },
        {
            "pathway_id": "eb21bc10c1d5f3359fea900229cd8089b152b9df4c71a405d39e9e8ce4bd238a",
            "courses": {
                "1": [
                    {
                        "course_name": "ESS2000",
                        "dept_abv": "ESS",
                        "course_title": "Environmental and Sustainability Sciences Colloquium",
                        "course_desc": "This colloquium presents students with diverse approaches used to interest, educate and motivate people to consider, address and solve environmental and sustainability challenges. The 1-credit version consists of a series of lectures given by experts, people with different expertise and perspectives who are addressing a variety of environmental and sustainability problems.",
                        "course_credits": 1.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/ESS/2000'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "ENGL1170",
                        "dept_abv": "ENGL",
                        "course_title": "FWS: Short Stories",
                        "course_desc": "What can a short story do that no other art form can do? We all consume and produce stories. To write about how narrative works, both within and against tradition, is to touch the core of identity, the quick of what makes us human. Storytelling informs all writing. Engaging diverse authors, we will practice not only reading sensitively and incisively but also making evidence-based arguments with power and grace, learning the habits of writing, revision, and documentation that allow us to join public or scholarly conversation. We will embrace \"shortness\" as a compression of meaning to unpack. Our own writing may include close analyses of texts, syntheses that place stories in critical dialogue, and both creative and research-based projects.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ENGL/1170'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "BIOEE1610",
                        "dept_abv": "BIOEE",
                        "course_title": "Introductory Biology: Ecology and the Environment",
                        "course_desc": "This course provides an introduction to ecology, covering interactions between organisms and the environment at scales of populations, communities, and ecosystems. Ecological principles are used to explore the theory and applications of major issues facing humanity in the 21st century, including population dynamics, disease ecology, biodiversity and invasive species, global change, and other topics of environmental sustainability.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOEE/1610'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "MATH1110",
                        "dept_abv": "MATH",
                        "course_title": "Calculus I",
                        "course_desc": "Topics include functions and graphs, limits and continuity, differentiation and integration of algebraic, trigonometric, inverse trig, logarithmic, and exponential functions; applications of differentiation, including graphing, max-min problems, tangent line approximation, implicit differentiation, and applications to the sciences; the mean value theorem; and antiderivatives, definite and indefinite integrals, the fundamental theorem of calculus, substitution in integration, the area under a curve. Graphing calculators are used, and their pitfalls are discussed, as applicable to the above topics.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/MATH/1110'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "PE1100",
                        "dept_abv": "PE",
                        "course_title": "Beginning Swimming",
                        "course_desc": "Instruction and practice in skills leading to passing the basic swimming proficiency test.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/PE/1100'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "NTRES1101",
                        "dept_abv": "SNES",
                        "course_title": "Introduction to Environmental Science and Sustainability",
                        "course_desc": "This course examines the depth and breadth of environmental science, focusing on principles from the physical and biological sciences that -- integrated with insights from the social sciences -- can help us understand environmental change and improve resource management.  Case studies, readings, discussions, and field and laboratory exercises focus on developing an interdisciplinary foundation for understanding how biophysical systems influence and are influenced by social processes.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA14/class/SNES/1101'",
                        "semester_taken": "2016FA"
                    }
                ],
                "2": [
                    {
                        "course_name": "ENGL1158",
                        "dept_abv": "ENGL",
                        "course_title": "FWS: American Voices",
                        "course_desc": "Topics and reading lists vary from section to section, but all will engage in some way with an aspect of American culture. Some sections may deal with fiction, poetry, film, or drama, and many include a mix of literary genres. Students will practice close, attentive, and imaginative reading and writing. Consult the John S. Knight Institute Current Courses webpage to access current year offerings, instructors and section descriptions.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ENGL/1158'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "BIOEE1780",
                        "dept_abv": "BIOEE",
                        "course_title": "An Introduction to Evolutionary Biology and Diversity",
                        "course_desc": "Considers explanations for pattern of diversity and the apparent good fit of organisms to the environment. Topics include the diversity of life, the genetics and developmental basis of evolutionary change, processes at the population level, evolution by natural selection, modes of speciation, long-term trends in evolution, origin of humans.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOEE/1780'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "NTRES2201",
                        "dept_abv": "BSOC",
                        "course_title": "Society and Natural Resources",
                        "course_desc": "The actions of people are crucial to environmental well-being. This course addresses the interrelationships between social phenomena and the natural (i.e., biophysical) environment. It is intended to (1) increase student awareness of these interconnections in their everyday lives; (2) introduce students to a variety of social science perspectives, including sociology, economics, psychology, and political science, that help us make sense of these connections; (3) identify the contributions of each of these perspectives to our understanding of environmental problems; and (4) discuss how natural resource management and environmental policy reflect these perspectives.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BSOC/2201'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "ASIAN2218",
                        "dept_abv": "ASIAN",
                        "course_title": "Introduction to Korea",
                        "course_desc": "This course provides a chronological survey of Korean culture and history from ancient times to the present. We will examine major historical time periods and cultural forms of the Korean peninsula, with a focus on the Chosŏn Dynasty (1392-1910) and the twentieth century. The course is designed to give students an overview of the transformations of Korean civilization in the context of the East Asian cultural sphere and globalization. We will engage with a wide range of texts and various media across time periods, including films, primary historical sources in translation, literature, and music videos. Key themes and topics of the course include the formation of South and North Korea's identities, the rise of Neo-Confucianism, Japanese\ncolonization and postcolonialism, the construction and performance of gender, the Korean War and postwar reconstruction, environmental degradation, and developments in popular culture.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ASIAN/2218'",
                        "semester_taken": "2017SP"
                    }
                ],
                "3": [
                    {
                        "course_name": "CHEM1560",
                        "dept_abv": "CHEM",
                        "course_title": "Introduction to General Chemistry",
                        "course_desc": "A one-semester introduction to fundamental topics in general chemistry, both qualitative and quantitative, with laboratory. CHEM 1560 prepares students for CHEM 1570; CHEM 1560 is not recommended for premedical or preveterinary students. Students planning to take CHEM 2080 should be enrolled in CHEM 2070 rather than CHEM 1560.",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/CHEM/1560'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "KOREA1101",
                        "dept_abv": "KOREA",
                        "course_title": "Elementary Korean I",
                        "course_desc": "Designed for students with no or very little knowledge of Korean in order to acquire the 4 skills (listening, speaking, reading and writing) of the Korean language and to become familiar with its culture. Students will learn the Korean writing system and basic survival language skills. Basic knowledge of Korean grammar, vocabulary, expressions and cultural points will be given during the lecture. Students will then have an opportunity to practice the learned knowledge in sections. By the end of the semester, students will be able to exchange in simple conversations with native Koreans about the subjects that are familiar to them: introducing oneself, describing events or objects, asking and giving directions to and from a certain place, talking about plans in the near future, etc.",
                        "course_credits": 6.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/KOREA/1101'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "NTRES2100",
                        "dept_abv": "NTRES",
                        "course_title": "Introductory Field Biology",
                        "course_desc": "Introduction to field identification, natural history, and study of plants, animals, and natural systems. Emphasizes the interaction of students with nature, the recording of ecological phenomena, and advancing student awareness and understanding of the natural environment, including ecological concepts (e.g., ecosystem, community, habitat, and niche). Students work cooperatively in hands-on field lab exercises to build skills in the identification and classification of native biota and their natural history. Students conduct an independent field research project in which they formulate research questions from field observations, develop a sampling plan, collect field data, and interpret those data for a research report/presentation. Students maintain a detailed field notebook of natural history observations from field labs and independent observations. ",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/NTRES/2100'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "BIOEE4690",
                        "dept_abv": "BIOEE",
                        "course_title": "Food, Agriculture, and Society",
                        "course_desc": "Multidisciplinary course dealing with the social and environmental impact of food production in the United States and developing countries. Agroecosystems of various kinds are analyzed from biological, economic, and social perspectives. The impacts of traditional, conventional, and alternative agricultural technologies are critically examined in the context of developed and developing economies. Specific topics include biodiversity and ecosystem services in agriculture, transgenic crops, biofuels, urban agriculture, and sustainable development.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOEE/4690'",
                        "semester_taken": "2017FA"
                    }
                ],
                "4": [
                    {
                        "course_name": "EAS1600",
                        "dept_abv": "EAS",
                        "course_title": "Environmental Physics",
                        "course_desc": "Fundamentals of radiation, thermodynamics, and mechanics will be introduced and used to understand energy and mass transfers in natural and built environments. Students will describe, identify and use basic principles of physics to discuss and assess renewable energy systems and solve environmental physics problems, using a physics vocabulary and appropriately quantifying results. The course is offered in the spring semester as a flipped class, meeting twice weekly. The course is offered in the fall semester as a web-based, online course and covers the same material.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/EAS/1600'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "AEM1500",
                        "dept_abv": "AEM",
                        "course_title": "An Introduction to the Economics of Environmental and Natural Resources",
                        "course_desc": "This course provides an introduction to the economic foundations for public decision-making regarding environmental quality and natural resources. Emphasis is placed on how basic tools of economic analysis can be used to identify sources of environmental problems and solutions to these problems. Topics to be covered include \"individual hand\" concepts underlying market success, market failure with particular focus on public goods and externalities, benefit-cost analysis and non-market valuation, incentive-based policies for controlling pollution, and economic aspects of renewable and non-renewable resources.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/1500'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "CHEM1570",
                        "dept_abv": "CHEM",
                        "course_title": "Introduction to Organic and Biological Chemistry",
                        "course_desc": "Introduction to organic chemistry with emphasis on structure, reactivity, and mechanisms of carbon compounds relevant to the life sciences.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/CHEM/1570'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "ILRLR3300",
                        "dept_abv": "ILRLR",
                        "course_title": "Advocacy and Debate",
                        "course_desc": "Students learn the principles of argumentation and debate. Topics emphasize Internet database research, synthesis of collected data, policy analysis, evidentiary quality, refutation of counter claims, identification of logical fallacies, risk evaluation, framing of issues, and coherent storytelling. Prepares students to work with a great range of opinion and evidence. Emphasizes different viewpoints, including those of different cultures. Assumptions are interrogated.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ILRLR/3300'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "STSCI2150",
                        "dept_abv": "STSCI",
                        "course_title": "Introductory Statistics for Biology",
                        "course_desc": "This course provides an introduction to data analysis and statistical inference illustrated with biological applications. The computer labs will teach graphical analysis and statistical computation using R. Topics include graphical display, populations and sampling, probability distributions, expectation and variance, estimation, testing, correlation, regression, contingency tables, and the design of experiments. Emphasis is on concepts and the careful modeling of biological data, so that statistical methods are applied properly, pitfalls are avoided, and sound conclusions are reached.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/STSCI/2150'",
                        "semester_taken": "2018SP"
                    }
                ],
                "5": [
                    {
                        "course_name": "ALS4309",
                        "dept_abv": "ALS",
                        "course_title": "na",
                        "course_desc": "na",
                        "course_credits": "na",
                        "course_semesters": "na",
                        "roster_links": "na",
                        "semester_taken": "2018FA"
                    }
                ],
                "6": [
                    {
                        "course_name": "ALS4309",
                        "dept_abv": "ALS",
                        "course_title": "na",
                        "course_desc": "na",
                        "course_credits": "na",
                        "course_semesters": "na",
                        "roster_links": "na",
                        "semester_taken": "2019SP"
                    }
                ],
                "7": [
                    {
                        "course_name": "NTRES3100",
                        "dept_abv": "NTRES",
                        "course_title": "Applied Population Ecology",
                        "course_desc": "In-depth analysis of the ecological factors influencing the natural fluctuation and regulation of animal population numbers. Develops models of single- and multi-species population dynamics, with emphasis on understanding the relationship between ecological processes operating at the individual level and subsequent dynamics at the population level. Significant emphasis is placed on application to conservation and management. Computer exercises are used to reinforce concepts presented in lecture.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/NTRES/3100'",
                        "semester_taken": "2019FA"
                    },
                    {
                        "course_name": "CRP3840",
                        "dept_abv": "CRP",
                        "course_title": "Green Cities",
                        "course_desc": "Cities are centers of innovation, economic growth, social mobility, and they provide economies of scale in the provision of infrastructure and social services. However, cities are also sites of growing socio-economic inequalities and environmental problems. Do cities provide the opportunity to address environmental problems, or are they rather the source of pollution and environmental degradation? Are cities the appropriate scale at which to address environmental problems? Are these really urban issues or do cities just cluster resource use and problems so they are more visible? What role does the built or physical environment have in impacting our behavior and decision making? This course examines social, economic, cultural, political and environmental dimensions of sustainability and sustainable development in urban areas.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/CRP/3840'",
                        "semester_taken": "2019FA"
                    },
                    {
                        "course_name": "NTRES3320",
                        "dept_abv": "NTRES",
                        "course_title": "Introduction to Ethics and Environment",
                        "course_desc": "Introduction to ethics, aesthetics, and epistemology as related to the environment. Asks the question \"How should I live?\" and explores the implications of different answers to that question for our treatment of nature. Also examines the various approaches to ethical theory; the relations between art, literature, religion, and morality; the objective nature of value judgments; and the subjective nature of nature.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/NTRES/3320'",
                        "semester_taken": "2019FA"
                    },
                    {
                        "course_name": "AAS2130",
                        "dept_abv": "AAS",
                        "course_title": "Introduction to Asian American History",
                        "course_desc": "An introductory history of Chinese, Japanese, Asian Indians, Filipinos, and Koreans in the United States from the mid-nineteenth century to the 1990s. Major themes include racism and resistance, labor migration, community formation, imperialism, and struggles for equality.",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AAS/2130'",
                        "semester_taken": "2019FA"
                    },
                    {
                        "course_name": "ASIAN2252",
                        "dept_abv": "ASIAN",
                        "course_title": "Introduction to Japanese Film",
                        "course_desc": "In this course, we will explore over one hundred years of Japanese cinema – one of the most prominent and diverse global film industries – from silent comedies to J-Horror, \"ramen westerns\" to Studio Ghibli.  You will gain a thorough grounding in film vocabulary and tools of cinematic analysis, allowing for deep investigations of gender, genre, history, and the connections between film and other media in modern and contemporary Japan.  All films will have English subtitles, and all readings will be available in English; no prior knowledge of Japanese language, history, or culture required.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/ASIAN/2252'",
                        "semester_taken": "2019FA"
                    }
                ],
                "8": [
                    {
                        "course_name": "NS3150",
                        "dept_abv": "NS",
                        "course_title": "Obesity and the Regulation of Body Weight",
                        "course_desc": "Multidisciplinary discussion of the causes, effects, and treatments of human obesity. Topics include the biopsychology of eating behavior, the genetics of obesity, the role of activity and energy metabolism, the psychosocial determinants of obesity, anorexia nervosa, therapy and its effectiveness, and social discrimination.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/NS/3150'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "BIOEE3690",
                        "dept_abv": "BIOEE",
                        "course_title": "Chemical Ecology",
                        "course_desc": "Why are chilies so spicy? This course examines the chemical basis of interactions between species and is intended for students with a basic knowledge of chemistry and biology. Focuses on the ecology and chemistry of plants, animals, and microbes. Stresses chemical signals used in diverse ecosystems, using Darwinian natural selection as a framework. Topics include: plant defenses, microbial warfare, communication in marine organisms, and human pheromones.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOEE/3690'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "PE1465",
                        "dept_abv": "PE",
                        "course_title": "Introduction to Squash",
                        "course_desc": "A beginner's course. Rules of the game and basic strokes are taught.  All necessary equipment is furnished. Please note: no black soled shoes are allowed on the courts and safety glasses are required to be worn at all times.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/PE/1465'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "VIET1100",
                        "dept_abv": "VIET",
                        "course_title": "Elements of Vietnamese Language and Culture",
                        "course_desc": "This course is designed for anyone wishing to gain some basic Vietnamese language skills and learn various elements of Vietnamese culture. Those who are planning to take short trips to Vietnam will find this course particularly useful.  Due to the flip classroom nature of the course, it is intended for sophomores and up.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/VIET/1100'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "NTRES2830",
                        "dept_abv": "NTRES",
                        "course_title": "DNA, Genes and Genetic Diversity",
                        "course_desc": "Covers molecular, Mendelian and population genetic principles as they relate to population biology and biodiversity.  A laboratory section is devoted to problem solving, computer exercises and discussions.  We will focus on mechanisms generating and shaping genetic variation within and among populations, examine the regulation of gene expression, and consider the conservation relevance of variation at multiple levels. Recommended as a preliminary to upper-level ecology, evolution, and natural resource management courses.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/NTRES/2830'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "EAS2550",
                        "dept_abv": "EAS",
                        "course_title": "Observing the Earth: Remote Sensing and GIS",
                        "course_desc": "While the challenges facing society over the next decades are diverse and complex, the next generation of scientists can look forward to a steadily increasing family of space-based observations that will help inform decisions about the environment - both to highlight potential problems and gain the attention of decision-makers, and to illustrate the effects of attempts at mitigation so that we can redirect our efforts into the most useful avenues. In this course, we will explore the key questions facing our planet today, and the relevant data from current and future satellite missions. We will introduce students to Geographical Information Systems (GIS) and other methods for viewing and manipulating.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/EAS/2550'",
                        "semester_taken": "2020SP"
                    }
                ]
            }
        },
        {
            "pathway_id": "f303248c922e5ebe959925e798185c6515eb3ea54e7e8df3f8583d62183d9e0d",
            "courses": {
                "1": [
                    {
                        "course_name": "HADM1740",
                        "dept_abv": "HADM",
                        "course_title": "Business Computing",
                        "course_desc": "Provides a foundation in information technology (IT) and how it relates to everyday business computing. Students learn IT concepts during lectures, and these concepts are reinforced in practical lab sessions using current standards of business computing. Topics include fundamental IT concepts; proficiency in Microsoft Office; understanding the issues of tool selection, standardization, and efficiency; integration of applications; and recognizing the importance of good computer management.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1740'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "HADM1650",
                        "dept_abv": "HADM",
                        "course_title": "Business Writing for Hospitality Professionals",
                        "course_desc": "Introduces the role and importance of effective communication in managerial work, especially in the hospitality industry. Students develop abilities in analytical thinking and clear expression. With an emphasis on business writing, this course builds foundational skills for creating professional-level communications. Students plan, develop, and produce increasingly complex written communications and deliver oral presentations.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1650'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "HADM1150",
                        "dept_abv": "HADM",
                        "course_title": "Organizational Behavior and Leadership Skills",
                        "course_desc": "This course provides students with the theoretical lenses and interpersonal skills required to become effective leaders of themselves and others at all organizational levels. With a particular emphasis on the hospitality industry, students develop an understanding and appreciation of the complexities of leading and managing individuals, teams and organizations, and acquire practical tools for accomplishing personal leadership and organizational goals within a service-based framework. Topics include understanding individual differences, leveraging conflict management, applying team-based problem-solving, understanding power and influence dynamics, principles of motivation, coaching and leadership, understanding of group process, and ethics.  The course emphasizes practical application of all concepts to students' personal and professional lives and goals, with particular emphasis on work-life in hospitality and broadly, service contexts. Students learn through the use of case studies, self-assessments, experiential exercises, readings, discussions, papers, and group activities.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1150'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "HADM1360",
                        "dept_abv": "HADM",
                        "course_title": "Introduction to Foodservice Management",
                        "course_desc": "Students are introduced to the principles of foodservice operations, beginning with an overview of the foodservice industry at large. Attention is initially focused on major industry segments, business practices, and trends. Subsequently, detailed consideration is given to the components of the foodservice system: marketing, menu planning, production, service, controls, and quality assurance. Product and systems differentiation in various industry segments are emphasized throughout the course. Completion of a work experience in the Statler Hotel is a required course activity.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1360'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "HADM1099",
                        "dept_abv": "HADM",
                        "course_title": "Orientation Part II",
                        "course_desc": "na",
                        "course_credits": 0.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP17/class/HADM/1099'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "HADM1910",
                        "dept_abv": "HADM",
                        "course_title": "Distinguished Lectures in Hospitality Management",
                        "course_desc": "The Dean's Distinguished Lecture Series is a long-standing School tradition that provides a unique opportunity for successful industry leaders to share their experiences with Cornell students. In its 92-year history, the Dean's Distinguished Lecture Series has hosted the most influential and accomplished leaders from every segment of the hospitality industry. Speakers share their views about successful management styles, possible career paths, critical industry-related issues, and qualities conducive to successful business leadership. Students have an unparalleled opportunity to learn and question how hospitality leaders view the current and future status of the industry.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1910'",
                        "semester_taken": "2014FA"
                    },
                    {
                        "course_name": "PE1300",
                        "dept_abv": "PE",
                        "course_title": "Introduction to Bowling",
                        "course_desc": "Instruction available during each class session for the Beginning or Intermediate level bowler. Choice of two 45 minute classes per week or one class for 90 minutes on Fridays. Shoe rental included in course fee which covers approximately 72 games.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/PE/1300'",
                        "semester_taken": "2014FA"
                    }
                ],
                "2": [
                    {
                        "course_name": "ANTHR2400",
                        "dept_abv": "ANTHR",
                        "course_title": "Cultural Diversity and Contemporary Issues",
                        "course_desc": "This course will introduce students to the meaning and significance of forms of cultural diversity for the understanding of contemporary issues. Drawing from films, videos, and selected readings, students will be confronted with different representational forms that portray cultures in various parts of the world, and they will be asked to examine critically their own prejudices as they influence the perception and evaluation of cultural differences. We shall approach cultures holistically, assuming the inseparability of economies, kinship, religion, and politics, as well as interconnections and dependencies between world areas such as Africa, Latin America, the West. Among the issues considered: political correctness and truth; nativism and ecological diversity; race, ethnicity, and sexuality; sin, religion, and war; global process and cultural integrity.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ANTHR/2400'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "HADM1350",
                        "dept_abv": "HADM",
                        "course_title": "Introduction to Hotel Operations",
                        "course_desc": "This course is designed to introduce students to the scope of the hotel industry and the organizational structure and operational mechanics of how the departments within the rooms division of an individual hotel operate. Understanding the scope of the industry involves understanding who the major players are and what market segments their brands serve. Students gain an understanding of how work is performed and how activities are coordinated within the rooms division and among other hotel departments. Completion of a rooms division practicum that exposes students to the housekeeping and front desk operations at the Statler Hotel is a required course activity. At the end of the course students will take the Certification in Hospitality Industry Analytics (CHIA) exam in hopes of achieving their CHIA. The certification is based upon content areas including hotel industry analytical foundations, hotel math fundamentals, property level benchmarking (STAR Reports), and industry performance reports.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1350'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "HADM1210",
                        "dept_abv": "HADM",
                        "course_title": "Financial Accounting",
                        "course_desc": "An introduction to financial accounting that studies transaction analysis, the balance sheet, income statement, statement of cash flows, and the statement of stockholder's equity. Accounting for investments, receivables, inventories, tangible and intangible assets, liabilities, long term bonds and capital stock transactions are studied. Basic financial ratios are introduced and interpreted. Ethical issues related to financial reporting are also discussed. Students who complete this course will have the pre-requisite knowledge to take HADM 2210  Managerial Accounting and HADM 2220 Finance.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1210'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "AAS3515",
                        "dept_abv": "AAS",
                        "course_title": "The Asian American Middle Class",
                        "course_desc": "The Asian American middle class is defined by having a certain level of education, bourgeoisie sets of manners, investment in home ownership, professional qualifications such as a doctor or an engineer, and participation in popular culture. This course takes a historical, cultural, and social perspective of the rise of the Asian American Middle Class from the late nineteenth century to the current day. How did Asian Americans become part of the American middle class? Did the middle class experience racism differently compared to the working class? And although many Asian Americans strived to belong to the middle class, what are the limits of middle-class Asian American politics and lifestyle? We will cover topics such as immigration, imperialism, family politics, second generation, popular culture, model minority, education, and suicides.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP16/class/AAS/3515'",
                        "semester_taken": "2015SP"
                    },
                    {
                        "course_name": "PE1300",
                        "dept_abv": "PE",
                        "course_title": "Introduction to Bowling",
                        "course_desc": "Instruction available during each class session for the Beginning or Intermediate level bowler. Choice of two 45 minute classes per week or one class for 90 minutes on Fridays. Shoe rental included in course fee which covers approximately 72 games.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/PE/1300'",
                        "semester_taken": "2015SP"
                    }
                ],
                "3": [
                    {
                        "course_name": "FDSC6000",
                        "dept_abv": "FDSC",
                        "course_title": "Seminar in Food Science",
                        "course_desc": "Weekly seminar series on contemporary topics and issues in the field of food science and technology. Representatives from academia, industry, and government provide presentations on a wide variety of topics. Graduate students in the field of food science and technology may use the forum to present their required thesis research seminar.",
                        "course_credits": 0.5,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/FDSC/6000'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "HADM1910",
                        "dept_abv": "HADM",
                        "course_title": "Distinguished Lectures in Hospitality Management",
                        "course_desc": "The Dean's Distinguished Lecture Series is a long-standing School tradition that provides a unique opportunity for successful industry leaders to share their experiences with Cornell students. In its 92-year history, the Dean's Distinguished Lecture Series has hosted the most influential and accomplished leaders from every segment of the hospitality industry. Speakers share their views about successful management styles, possible career paths, critical industry-related issues, and qualities conducive to successful business leadership. Students have an unparalleled opportunity to learn and question how hospitality leaders view the current and future status of the industry.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1910'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "HADM2360",
                        "dept_abv": "HADM",
                        "course_title": "Food Service Management, Theory and Practice",
                        "course_desc": "This course introduces food and beverage operations management through four major components: fundamental food composition and properties; food products and preparation; food safety; and the application of management concepts to food and beverage operations. Students prepare recipes, menus, and production schedules; critically evaluate foods; and are involved in projects in which they create menus, develop and standardize recipes, and calculate yield percentages and food cost. Completion of a four-hour practicum experience in Establishment is a required course activity.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2360'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "HIST2003",
                        "dept_abv": "HIST",
                        "course_title": "Becker House Cafe",
                        "course_desc": "This course will bring students and professors together in a relatively informal setting. Professors - some invited by the instructor and some by the students - will discuss their academic interests and careers. In the past, this format has allowed students to understand better the intellectual, personal, moral, social, and other questions that drive academic inquiry in a context that is not constrained by the internal questions \"will this be on the final?\"",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP17/class/HIST/2003'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "HADM2550",
                        "dept_abv": "HADM",
                        "course_title": "Hospitality Development and Planning",
                        "course_desc": "Students are introduced to the issues and opportunities inherent in the development and planning of hospitality facilities, specifically hotels and restaurants. Course components include the project development sequence, conceptual and space planning, architectural design criteria, construction management, and the interpretation of architectural design and consultant drawings. There is an emphasis on setting appropriate facilities requirements, understanding industry practice, and implementing properties decisions within a balanced design, operations, and financial framework.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2550'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "HADM2810",
                        "dept_abv": "HADM",
                        "course_title": "Human Resources Management",
                        "course_desc": "Facilitates an understanding of the policies, procedures, and systems required to attract, select, develop, and retain quality employees. Students learn about the major environmental factors that affect the HR function, including legislation, economics, and demographics. The course emphasizes HR issues and challenges that are particularly relevant to the hospitality industry. Instruction is based on lecture, discussion, and experiential activities, as well as case analysis and project work.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2810'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "AAS2130",
                        "dept_abv": "AAS",
                        "course_title": "Introduction to Asian American History",
                        "course_desc": "An introductory history of Chinese, Japanese, Asian Indians, Filipinos, and Koreans in the United States from the mid-nineteenth century to the 1990s. Major themes include racism and resistance, labor migration, community formation, imperialism, and struggles for equality.",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AAS/2130'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "HADM2210",
                        "dept_abv": "HADM",
                        "course_title": "Managerial Accounting",
                        "course_desc": "This course focuses on the use of accounting information for management decision making and control in hospitality settings. Topics include costing objects, budgeting, financial decision making, cost behavior, and management control systems. There will be one common final exam at the end of the semester.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2210'",
                        "semester_taken": "2015FA"
                    }
                ],
                "4": [
                    {
                        "course_name": "HADM2220",
                        "dept_abv": "HADM",
                        "course_title": "Finance",
                        "course_desc": "This course provides an introduction to core ideas in finance as well as a foundation for further study.  Upon completion of this course students should be able to (1) perform basic valuation of cash flows from projects, bonds, and stocks; (2) demonstrate basic understanding of capital budgeting decisions through the use of concepts including the time value of money and discounted cash flow analysis; (3) assess the relation between risk and return and integrate that knowledge in determining corporate cost of capital; and (4) demonstrate an understanding of the role of debt and equity in corporate capital structure.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2220'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "HADM2010",
                        "dept_abv": "HADM",
                        "course_title": "Hospitality Quantitative Analysis",
                        "course_desc": "This introductory statistics course is taught from the perspective of solving problems and making decisions within the hospitality industry. Students learn introductory probability, as well as how to gather data, evaluate the quality of data, graphically represent data, and apply some fundamental statistical methodologies. Statistical methods covered include: estimation and hypothesis testing relating to one- and two-sample problems of means, simple linear regression, and multiple regression. Excel is used as the statistical computing software and the class uses a very hands-on approach.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2010'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "WRIT1380",
                        "dept_abv": "WRIT",
                        "course_title": "FWS: Elements of Academic Writing",
                        "course_desc": "The Writing 1380 classroom is a dynamic workspace where students assemble the scholarly tools necessary to explore complex, interdisciplinary questions. Because Writing 1380 is designed as a workshop, students develop the analytic and argumentative skills fundamental to interdisciplinary reading, research, and writing by collaborating with peers to pose questions, examine ideas, and share drafts. With smaller class sizes, two 50-minute class sessions and weekly student / teacher conferences, Writing 1380 provides an individualized setting for students to learn flexible and sustainable strategies for studying the essential elements of academic writing and for producing clear, precise academic prose that can address a variety of audiences and meet diverse rhetorical aims.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/WRIT/1380'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "HADM2430",
                        "dept_abv": "HADM",
                        "course_title": "Marketing Management for Services",
                        "course_desc": "Students develop an understanding of marketing management for hospitality and related service organizations: the process through which organizations analyze, plan, implement, and control programs to develop and maintain beneficial exchanges with target buyers. Students learn about marketing management through a mix of readings, lectures, class discussions, individual and group exercises, industry guest speakers, and exams.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2430'",
                        "semester_taken": "2016SP"
                    }
                ],
                "6": [
                    {
                        "course_name": "HADM3610",
                        "dept_abv": "HADM",
                        "course_title": "Communication for Entrepreneurs",
                        "course_desc": "Communication skills are essential for entrepreneurs.  Entrepreneurs face unique communication challenges when communicating with initial investors, business partners, founding employees, first customers, and the media.  Students will apply course concepts to their own ideas while developing communication competencies in a variety of entrepreneurial communication contexts.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP19/class/HADM/3610'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "HADM3210",
                        "dept_abv": "HADM",
                        "course_title": "Principles of Hospitality Real Estate",
                        "course_desc": "This course emphasizes practical valuation and decision-making skills. You will receive an introduction to the business of hospitality and commercial real estate, including content on the major roles, activities and players, terminology, and how the relevant financial tools, institutional concepts, and economic models are used for sound investment decision-making.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3210'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "HADM3010",
                        "dept_abv": "HADM",
                        "course_title": "Service Operations Management",
                        "course_desc": "Operations management is the study of how things work. In this class, we will discuss how operations management can be used to help a hospitality company compete. After completing this course, you will: (1) understand core concepts, models and managerial issues in service operations management, (2) critically assess the performance of service delivery processes, (3) learn how to manage supply and demand, (4) learn how to manage quality, (5) develop proficiency in a range of quantitative and qualitative techniques necessary for hospitality service organizations, (6) learn how to manage a project, and (7) apply the concepts and techniques learned in class to the analysis of real-world service delivery processes.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3010'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "HADM3550",
                        "dept_abv": "HADM",
                        "course_title": "Hospitality Facilities Management",
                        "course_desc": "This course provides an overview of the operation of hospitality facilities, including operating costs for various types of facilities, types and characteristics of major building systems, sustainable aspects of building equipment and management, and the responsibilities of the engineering maintenance department. The renovation needs and key managerial aspects of hospitality facility renovation projects are examined.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3550'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "HADM3360",
                        "dept_abv": "HADM",
                        "course_title": "Tactics and Strategies for Restaurant Management",
                        "course_desc": "This course examines the key success factors behind foodservice management connecting the interrelated elements of marketing, operations, and finance with a shared emphasis on tactical and strategic issues and problem solving. Students learn by engaging in a series of team-based managerial and operational decisions through the highly animated Cornell Restaurant Administration Simulation Exercise (CRASE).",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA17/class/HADM/3360'",
                        "semester_taken": "2017SP"
                    }
                ],
                "7": [
                    {
                        "course_name": "HADM3870",
                        "dept_abv": "HADM",
                        "course_title": "Business and Hospitality Law",
                        "course_desc": "Provides students with an integrated presentation of employment discrimination, tort, and contract concepts as they apply to the legal aspects of hospitality management. Students examine relevant federal and state cases and statutes. The overall objective is to enable students to recognize, analyze, and evaluate legal issues for the purpose of making and articulating appropriate decisions in the workplace.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3870'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "HADM4410",
                        "dept_abv": "HADM",
                        "course_title": "Strategic Management",
                        "course_desc": "Strategic management integrates all of student's previous courses, including marketing, finance, accounting, operations, etc., and introduces them to new strategic management concepts. The course examines the total enterprise, the industry, and the competitive environment in which it operates. The goal is to develop a mastery of the analytical tools to perform analyses of the industry and competitors. The course focuses on how firms formulate, implement, and evaluate strategies. Using a case-based approach, the course emphasizes critical thinking and decision making to maintain competitive advantage in a hypercompetitive and maturing industry.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/4410'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "HADM3135",
                        "dept_abv": "HADM",
                        "course_title": "Conversations with Entrepreneurs",
                        "course_desc": "This course will guide students to answer the fundamental question: \"Why Entrepreneurialism? Is it the right path for me?\".  Many people say they want to start a business but don't expect and desire the authority and responsibility that comes with it. The objective of this course is to both broaden students' thinking about what constitutes the field of entrepreneurial endeavor – and to sharpen their focus on the unique attributes they bring to the table in considering launching entrepreneurial ventures of their own in the future.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/HADM/3135'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "HADM3350",
                        "dept_abv": "HADM",
                        "course_title": "Restaurant Management",
                        "course_desc": "This course covers concepts, issues, and business principles relevant to the restaurant industry, including market analysis, menu and service systems, and financial and operational management and applies them in a real-life restaurant setting. Students conceptualize and manage the operations of an in-person restaurant open to the Cornell community and evaluate the process and outcomes.  Successful completion of the course requires students to complete TiPS and ServSafe certifications shortly after the start of the semester.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3350'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "HADM4300",
                        "dept_abv": "HADM",
                        "course_title": "Introduction to Wines",
                        "course_desc": "Students will be introduced to the major wine-producing regions of the world. The course focuses on understanding the terms on a wine label, discussing aromas and flavors and connecting flavors to the growing and productions factors that influence them. Food and wine pairing, wine etiquette and responsible consumption are also topics. This forms the basis for what a consumer needs to know to confidently navigate a wine list and to make sound purchase decisions in retail wine shops or online.",
                        "course_credits": 2.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/4300'",
                        "semester_taken": "2017FA"
                    }
                ],
                "8": [
                    {
                        "course_name": "HADM4301",
                        "dept_abv": "HADM",
                        "course_title": "Restaurant Entrepreneurship",
                        "course_desc": "This course is designed for students who have a strong interest in food and beverage operations and who may be considering a career as an entrepreneur. Under the supervision of the instructor and using student-developed case studies, students visit and analyze various independently owned and corporate restaurant operations. Analysis covers, but is not limited to, the restaurant's concept (market), organization, ownership, management, physical structure, staff, front-of-the-house operations, back-of-the-house operations, and fiscal integrity. Readings about current topics in the restaurant industry are required. Classes alternate weekly between field trips (2:30 p.m. through dinner hour) and seminars/case presentations.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/HADM/4301'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "HADM4020",
                        "dept_abv": "HADM",
                        "course_title": "Wellness and Spas",
                        "course_desc": "The global wellness economy is a $4.2 trillion dollar economy made up of industries that enable consumers to incorporate wellness activities and choices into their lifestyles. The spa economy is estimated at $119 billion dollars with spa facilities making up $93.6 billion dollars of the total spa economy. \"Wellness and Spas\" is designed to educate students about wellness and to look at spas and the spa industry to better understand this incredibly exciting part of the hospitality industry and what it needs to do to be positioned to take advantage of future wellness trends. Students will also have an opportunity to work on consulting projects for several spa industry leaders.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/HADM/4020'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "HADM3650",
                        "dept_abv": "HADM",
                        "course_title": "Persuasive Business Communication for Hospitality Leaders",
                        "course_desc": "Develops the knowledge and skills that hospitality managers need to face an array of persuasive communication challenges. This course builds on the principles of effective managerial communication (HADM 1650) and organizational behavior and interpersonal skills (HADM 1150). The course introduces the theory and principles of persuasion and focuses on their application in a range of management and leadership contexts.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3650'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "HADM4290",
                        "dept_abv": "HADM",
                        "course_title": "Investment Analysis and Portfolio Management",
                        "course_desc": "The course is an exploration of the three major investment vehicles: bonds, equity, and derivatives. In each case, students discuss what they are, how they are valued, and what risks they entail. The intimate relationship between return/value and risk is explored. At the focus of these discussions lies the idea that optimal investing is chiefly about balancing risk with returns; extracting maximum gains with minimum exposure; and creating portfolios with \"good trade-offs.\" A study of theories develops a toolkit of skills, and a detailed look at practical application, including pricing anomalies, trading \"programs,\" and a hands-on portfolio simulation, illuminate this investigation.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP18/class/HADM/4290'",
                        "semester_taken": "2018SP"
                    }
                ]
            }
        },
        {
            "pathway_id": "08568ff489a8fba1db5fe3c7578aceebdc368cbddafd335f7f1c62c4ac6e3ac9",
            "courses": {
                "1": [
                    {
                        "course_name": "ECON1110",
                        "dept_abv": "ECON",
                        "course_title": "Introductory Microeconomics",
                        "course_desc": "Explanation and evaluation of how the price system operates in determining what goods are produced, how goods are produced, who receives income, and how the price system is modified and influenced by private organizations and government policy.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ECON/1110'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "COML1126",
                        "dept_abv": "COML",
                        "course_title": "FWS: Comparative Arts and Media",
                        "course_desc": "Matches the second track in our major, Literary, Visual, and Media Studies.  This course rubric deals with courses that compare literature to film, video, performance, and other arts. Consult the John. S. Knight Writing Seminar Program brochure for current year offerings, instructions and section descriptions: http://www.arts.cornell.edu/knight_institute/fws/fws.htm",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP18/class/COML/1126'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "PLSCS1900",
                        "dept_abv": "PLSCS",
                        "course_title": "Sustainable Agriculture: Food, Farming, and the Future",
                        "course_desc": "Introduction to agronomy and agroecology and an exploration of environmental, economic, and social factors that influence agriculture. Students participate in interactive discussions about food systems and food security. Labs include field trips to a variety of field crop, vegetable, and dairy farms and experiential activities designed to enhance understanding of important themes in sustainable agriculture, including multifunctionality and resilience.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/PLSCS/1900'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "MILS1101",
                        "dept_abv": "MILS",
                        "course_title": "Foundations of Officership",
                        "course_desc": "Students examine the U.S. defense structure in terms of organization, mission, personnel, and relationships among and between military forces and branches and departments of the government. The U.S. Army force structure is examined at all levels. The complexities and magnitude of operating the defense organization are studied to provide a framework for subsequent instruction. Students develop skills in conducting oral and written presentations.",
                        "course_credits": 2.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/MILS/1101'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "IARD2020",
                        "dept_abv": "DSOC",
                        "course_title": "Perspectives on International Agriculture and Rural Development",
                        "course_desc": "Designed to enable students to gain an understanding of major issues in international agricultural development. The course provides an overview of world poverty and hunger and of varying perspectives on approaches being taken to address these and related problems. Students characterize the state of agriculture and rural livelihoods in selected developing countries, and analyze how innovations in agriculture in these countries can contribute to rural development.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA16/class/DSOC/2020'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "PE1851",
                        "dept_abv": "MILS",
                        "course_title": "Leadership Laboratory I",
                        "course_desc": "MILS I cadets meet for two hours each week to learn a variety of military skills including rappelling, first aid, drill and ceremonies, weapons familiarization, physical fitness training, and small group leadership.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/MILS/1111'",
                        "semester_taken": "2015FA"
                    },
                    {
                        "course_name": "SOC1101",
                        "dept_abv": "SOC",
                        "course_title": "Introduction to Sociology",
                        "course_desc": "This course is a broad introduction to the field of sociology.  Course materials are designed to illustrate the distinctive features of the sociological perspective and to start you thinking sociologically about yourself and the broader social world.  To think sociologically is to recognize that being embedded in the world constrains behavior, and that individuals are both social actors and social products.  To think sociologically is also to recognize that our contemporary world, with its enduring cultural, political, and economic institutions, is as much a social product as we are.  We will begin by covering theoretical and methodological foundations of the sociological perspective.  We will go on to explore the concept of social stratification and will survey primary axes of social difference.  In the second half of the course we will look more closely at how individuals relate to each other, how social inequality is enacted and reinforced in everyday life, and at the way in which the organization of social life shapes individuals and groups, such as through social networks, residential neighborhoods, schooling, families, and on-line communication.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/SOC/1101'",
                        "semester_taken": "2015FA"
                    }
                ],
                "2": [
                    {
                        "course_name": "HADM1350",
                        "dept_abv": "HADM",
                        "course_title": "Introduction to Hotel Operations",
                        "course_desc": "This course is designed to introduce students to the scope of the hotel industry and the organizational structure and operational mechanics of how the departments within the rooms division of an individual hotel operate. Understanding the scope of the industry involves understanding who the major players are and what market segments their brands serve. Students gain an understanding of how work is performed and how activities are coordinated within the rooms division and among other hotel departments. Completion of a rooms division practicum that exposes students to the housekeeping and front desk operations at the Statler Hotel is a required course activity. At the end of the course students will take the Certification in Hospitality Industry Analytics (CHIA) exam in hopes of achieving their CHIA. The certification is based upon content areas including hotel industry analytical foundations, hotel math fundamentals, property level benchmarking (STAR Reports), and industry performance reports.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1350'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "HADM1740",
                        "dept_abv": "HADM",
                        "course_title": "Business Computing",
                        "course_desc": "Provides a foundation in information technology (IT) and how it relates to everyday business computing. Students learn IT concepts during lectures, and these concepts are reinforced in practical lab sessions using current standards of business computing. Topics include fundamental IT concepts; proficiency in Microsoft Office; understanding the issues of tool selection, standardization, and efficiency; integration of applications; and recognizing the importance of good computer management.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1740'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "HADM1810",
                        "dept_abv": "HADM",
                        "course_title": "Introduction to Management",
                        "course_desc": "This course provides an introduction to the basic concepts and topics associated with managing and leading organizations, groups, and individuals.  The traditional functions of management (planning, organizing, leading, and controlling) are discussed, with special attention paid to current workplace issues and developments, such as corporate social responsibility, ethics, and diversity.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1810'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "HADM1210",
                        "dept_abv": "HADM",
                        "course_title": "Financial Accounting",
                        "course_desc": "An introduction to financial accounting that studies transaction analysis, the balance sheet, income statement, statement of cash flows, and the statement of stockholder's equity. Accounting for investments, receivables, inventories, tangible and intangible assets, liabilities, long term bonds and capital stock transactions are studied. Basic financial ratios are introduced and interpreted. Ethical issues related to financial reporting are also discussed. Students who complete this course will have the pre-requisite knowledge to take HADM 2210  Managerial Accounting and HADM 2220 Finance.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1210'",
                        "semester_taken": "2016SP"
                    },
                    {
                        "course_name": "PE1604",
                        "dept_abv": "PE",
                        "course_title": "Outdoor Adventure",
                        "course_desc": "From the gorges of Ithaca, to the lakes of Cornell, this course will give you a taste of it all. This multi-activity course is aimed at the beginner who would like a taste of many different outdoor pursuits. The course will provide an introduction to day hiking, indoor rock climbing, canoeing, and camping.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP16/class/PE/1604'",
                        "semester_taken": "2016SP"
                    }
                ],
                "3": [
                    {
                        "course_name": "HADM1650",
                        "dept_abv": "HADM",
                        "course_title": "Business Writing for Hospitality Professionals",
                        "course_desc": "Introduces the role and importance of effective communication in managerial work, especially in the hospitality industry. Students develop abilities in analytical thinking and clear expression. With an emphasis on business writing, this course builds foundational skills for creating professional-level communications. Students plan, develop, and produce increasingly complex written communications and deliver oral presentations.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1650'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "HADM2010",
                        "dept_abv": "HADM",
                        "course_title": "Hospitality Quantitative Analysis",
                        "course_desc": "This introductory statistics course is taught from the perspective of solving problems and making decisions within the hospitality industry. Students learn introductory probability, as well as how to gather data, evaluate the quality of data, graphically represent data, and apply some fundamental statistical methodologies. Statistical methods covered include: estimation and hypothesis testing relating to one- and two-sample problems of means, simple linear regression, and multiple regression. Excel is used as the statistical computing software and the class uses a very hands-on approach.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2010'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "HADM3135",
                        "dept_abv": "HADM",
                        "course_title": "Conversations with Entrepreneurs",
                        "course_desc": "This course will guide students to answer the fundamental question: \"Why Entrepreneurialism? Is it the right path for me?\".  Many people say they want to start a business but don't expect and desire the authority and responsibility that comes with it. The objective of this course is to both broaden students' thinking about what constitutes the field of entrepreneurial endeavor – and to sharpen their focus on the unique attributes they bring to the table in considering launching entrepreneurial ventures of their own in the future.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/HADM/3135'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "HADM1150",
                        "dept_abv": "HADM",
                        "course_title": "Organizational Behavior and Leadership Skills",
                        "course_desc": "This course provides students with the theoretical lenses and interpersonal skills required to become effective leaders of themselves and others at all organizational levels. With a particular emphasis on the hospitality industry, students develop an understanding and appreciation of the complexities of leading and managing individuals, teams and organizations, and acquire practical tools for accomplishing personal leadership and organizational goals within a service-based framework. Topics include understanding individual differences, leveraging conflict management, applying team-based problem-solving, understanding power and influence dynamics, principles of motivation, coaching and leadership, understanding of group process, and ethics.  The course emphasizes practical application of all concepts to students' personal and professional lives and goals, with particular emphasis on work-life in hospitality and broadly, service contexts. Students learn through the use of case studies, self-assessments, experiential exercises, readings, discussions, papers, and group activities.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1150'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "HADM1360",
                        "dept_abv": "HADM",
                        "course_title": "Introduction to Foodservice Management",
                        "course_desc": "Students are introduced to the principles of foodservice operations, beginning with an overview of the foodservice industry at large. Attention is initially focused on major industry segments, business practices, and trends. Subsequently, detailed consideration is given to the components of the foodservice system: marketing, menu planning, production, service, controls, and quality assurance. Product and systems differentiation in various industry segments are emphasized throughout the course. Completion of a work experience in the Statler Hotel is a required course activity.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/1360'",
                        "semester_taken": "2016FA"
                    }
                ],
                "4": [
                    {
                        "course_name": "HADM2210",
                        "dept_abv": "HADM",
                        "course_title": "Managerial Accounting",
                        "course_desc": "This course focuses on the use of accounting information for management decision making and control in hospitality settings. Topics include costing objects, budgeting, financial decision making, cost behavior, and management control systems. There will be one common final exam at the end of the semester.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2210'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "HADM2360",
                        "dept_abv": "HADM",
                        "course_title": "Food Service Management, Theory and Practice",
                        "course_desc": "This course introduces food and beverage operations management through four major components: fundamental food composition and properties; food products and preparation; food safety; and the application of management concepts to food and beverage operations. Students prepare recipes, menus, and production schedules; critically evaluate foods; and are involved in projects in which they create menus, develop and standardize recipes, and calculate yield percentages and food cost. Completion of a four-hour practicum experience in Establishment is a required course activity.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2360'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "HADM2810",
                        "dept_abv": "HADM",
                        "course_title": "Human Resources Management",
                        "course_desc": "Facilitates an understanding of the policies, procedures, and systems required to attract, select, develop, and retain quality employees. Students learn about the major environmental factors that affect the HR function, including legislation, economics, and demographics. The course emphasizes HR issues and challenges that are particularly relevant to the hospitality industry. Instruction is based on lecture, discussion, and experiential activities, as well as case analysis and project work.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2810'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "HADM2550",
                        "dept_abv": "HADM",
                        "course_title": "Hospitality Development and Planning",
                        "course_desc": "Students are introduced to the issues and opportunities inherent in the development and planning of hospitality facilities, specifically hotels and restaurants. Course components include the project development sequence, conceptual and space planning, architectural design criteria, construction management, and the interpretation of architectural design and consultant drawings. There is an emphasis on setting appropriate facilities requirements, understanding industry practice, and implementing properties decisions within a balanced design, operations, and financial framework.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2550'",
                        "semester_taken": "2017SP"
                    }
                ],
                "5": [
                    {
                        "course_name": "HADM3010",
                        "dept_abv": "HADM",
                        "course_title": "Service Operations Management",
                        "course_desc": "Operations management is the study of how things work. In this class, we will discuss how operations management can be used to help a hospitality company compete. After completing this course, you will: (1) understand core concepts, models and managerial issues in service operations management, (2) critically assess the performance of service delivery processes, (3) learn how to manage supply and demand, (4) learn how to manage quality, (5) develop proficiency in a range of quantitative and qualitative techniques necessary for hospitality service organizations, (6) learn how to manage a project, and (7) apply the concepts and techniques learned in class to the analysis of real-world service delivery processes.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3010'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "HADM2220",
                        "dept_abv": "HADM",
                        "course_title": "Finance",
                        "course_desc": "This course provides an introduction to core ideas in finance as well as a foundation for further study.  Upon completion of this course students should be able to (1) perform basic valuation of cash flows from projects, bonds, and stocks; (2) demonstrate basic understanding of capital budgeting decisions through the use of concepts including the time value of money and discounted cash flow analysis; (3) assess the relation between risk and return and integrate that knowledge in determining corporate cost of capital; and (4) demonstrate an understanding of the role of debt and equity in corporate capital structure.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2220'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "HADM2430",
                        "dept_abv": "HADM",
                        "course_title": "Marketing Management for Services",
                        "course_desc": "Students develop an understanding of marketing management for hospitality and related service organizations: the process through which organizations analyze, plan, implement, and control programs to develop and maintain beneficial exchanges with target buyers. Students learn about marketing management through a mix of readings, lectures, class discussions, individual and group exercises, industry guest speakers, and exams.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/2430'",
                        "semester_taken": "2017FA"
                    },
                    {
                        "course_name": "HADM3870",
                        "dept_abv": "HADM",
                        "course_title": "Business and Hospitality Law",
                        "course_desc": "Provides students with an integrated presentation of employment discrimination, tort, and contract concepts as they apply to the legal aspects of hospitality management. Students examine relevant federal and state cases and statutes. The overall objective is to enable students to recognize, analyze, and evaluate legal issues for the purpose of making and articulating appropriate decisions in the workplace.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3870'",
                        "semester_taken": "2017FA"
                    }
                ],
                "6": [
                    {
                        "course_name": "HADM4840",
                        "dept_abv": "HADM",
                        "course_title": "Labor in the Modern Service Economy: Markets, Crisis, and Public Policy",
                        "course_desc": "In this course students will learn how public policy and the state of the economy affect labor markets and firm performance. We will analyze issues of particular relevance to the hospitality sector and its associated labor markets. We will learn about the macro-economy by examining periods of economic crisis, including the global crisis of 2008 and the continuing crisis in the Eurozone. Topics include the causes and consequences of economic crises; the relationship between technological change and employment; structural transformation and the transition to a service-based economy; the changing nature of employment, including the rise of the so-called \"gig economy\"; and the impact of labor market policies and the Fight for $15.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP18/class/HADM/4840'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "HADM3550",
                        "dept_abv": "HADM",
                        "course_title": "Hospitality Facilities Management",
                        "course_desc": "This course provides an overview of the operation of hospitality facilities, including operating costs for various types of facilities, types and characteristics of major building systems, sustainable aspects of building equipment and management, and the responsibilities of the engineering maintenance department. The renovation needs and key managerial aspects of hospitality facility renovation projects are examined.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3550'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "HADM4350",
                        "dept_abv": "HADM",
                        "course_title": "Selection, Procurement, and Supply Chain Management",
                        "course_desc": "This course deals with contemporary management issues related to procurement activities within the hospitality industry. Focus is on both the food distribution industry and the hospitality industry so that students understand the role the distributor plays in the movement of food and supplies from the producer to the hospitality operator and how the creation of distribution partnerships serves to improve efficiency and reduce costs. Topics include distribution channels and intermediaries in the supply chain, food distributor financial statement analysis, evaluation and selection of suppliers, development of buying strategies, influence of economic and environmental factors on supply, purchase timing and inventory management, the emerging role of the Internet, and e-procurement service providers.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/4350'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "HADM3210",
                        "dept_abv": "HADM",
                        "course_title": "Principles of Hospitality Real Estate",
                        "course_desc": "This course emphasizes practical valuation and decision-making skills. You will receive an introduction to the business of hospitality and commercial real estate, including content on the major roles, activities and players, terminology, and how the relevant financial tools, institutional concepts, and economic models are used for sound investment decision-making.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3210'",
                        "semester_taken": "2018SP"
                    },
                    {
                        "course_name": "HADM3650",
                        "dept_abv": "HADM",
                        "course_title": "Persuasive Business Communication for Hospitality Leaders",
                        "course_desc": "Develops the knowledge and skills that hospitality managers need to face an array of persuasive communication challenges. This course builds on the principles of effective managerial communication (HADM 1650) and organizational behavior and interpersonal skills (HADM 1150). The course introduces the theory and principles of persuasion and focuses on their application in a range of management and leadership contexts.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3650'",
                        "semester_taken": "2018SP"
                    }
                ],
                "7": [
                    {
                        "course_name": "HADM4080",
                        "dept_abv": "HADM",
                        "course_title": "Introduction to Casino Operations",
                        "course_desc": "Introduction to Casino Operations focuses primarily on the operation and ownership of US commercial casinos, and the hotels attached to them and Native American gambling.  We will look at the historical development of gaming in America to understand how the industry has evolved to its present form.  By the end of the course, students will understand the organizational structure of a casino hotel, how it operates and how it makes money.  Students will also gain an understanding of the different companies involved in owning casino hotels and the current issues facing these companies.  We will look at casino marketing strategies and player rating systems.  We will examine the social and economic impact of gaming and the various regulatory environments within which casinos operate.  We will learn how common casino games are played as well as understand the mathematics of the various games.  Students will build on their food and beverage and hotel knowledge to better understand the specific challenges facing casino hotel operators.",
                        "course_credits": 2.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA18/class/HADM/4080'",
                        "semester_taken": "2018FA"
                    },
                    {
                        "course_name": "HADM4410",
                        "dept_abv": "HADM",
                        "course_title": "Strategic Management",
                        "course_desc": "Strategic management integrates all of student's previous courses, including marketing, finance, accounting, operations, etc., and introduces them to new strategic management concepts. The course examines the total enterprise, the industry, and the competitive environment in which it operates. The goal is to develop a mastery of the analytical tools to perform analyses of the industry and competitors. The course focuses on how firms formulate, implement, and evaluate strategies. Using a case-based approach, the course emphasizes critical thinking and decision making to maintain competitive advantage in a hypercompetitive and maturing industry.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/4410'",
                        "semester_taken": "2018FA"
                    },
                    {
                        "course_name": "HADM4301",
                        "dept_abv": "HADM",
                        "course_title": "Restaurant Entrepreneurship",
                        "course_desc": "This course is designed for students who have a strong interest in food and beverage operations and who may be considering a career as an entrepreneur. Under the supervision of the instructor and using student-developed case studies, students visit and analyze various independently owned and corporate restaurant operations. Analysis covers, but is not limited to, the restaurant's concept (market), organization, ownership, management, physical structure, staff, front-of-the-house operations, back-of-the-house operations, and fiscal integrity. Readings about current topics in the restaurant industry are required. Classes alternate weekly between field trips (2:30 p.m. through dinner hour) and seminars/case presentations.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/HADM/4301'",
                        "semester_taken": "2018FA"
                    },
                    {
                        "course_name": "HADM4315",
                        "dept_abv": "HADM",
                        "course_title": "Nonprofit Social Enterprise and Food Justice",
                        "course_desc": "This course will provide an overview of nonprofit food service management through service-learning, with a focus food systems, social ventures and economic policies. Key objectives include identifying management best practices for leading nonprofit food service organizations, including strategy, managing employees/volunteers, fundraising, grant proposal writing, board governance, and marketing and social media. Through lectures, class discussions, case study analysis, research, community service work, and a service learning final project working in collaboration with HADM 4340, students will explore the economic, social, and political issues of combating poverty and hunger in the United States. The focus of the course will be on nonprofit food service organizations designed to combat hunger in our communities such as food banks, soup kitchens and shelters, and community outreach programs, and school feeding program.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/4315'",
                        "semester_taken": "2018FA"
                    },
                    {
                        "course_name": "HADM3200",
                        "dept_abv": "HADM",
                        "course_title": "Personal Financial Management",
                        "course_desc": "Students are provided with an overview of personal financial planning including money management, tax planning, use of credit, insurance, investing, retirement planning, and estate planning.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA18/class/HADM/3200'",
                        "semester_taken": "2018FA"
                    }
                ],
                "8": [
                    {
                        "course_name": "ILRLR3300",
                        "dept_abv": "ILRLR",
                        "course_title": "Advocacy and Debate",
                        "course_desc": "Students learn the principles of argumentation and debate. Topics emphasize Internet database research, synthesis of collected data, policy analysis, evidentiary quality, refutation of counter claims, identification of logical fallacies, risk evaluation, framing of issues, and coherent storytelling. Prepares students to work with a great range of opinion and evidence. Emphasizes different viewpoints, including those of different cultures. Assumptions are interrogated.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ILRLR/3300'",
                        "semester_taken": "2019SP"
                    },
                    {
                        "course_name": "PSYCH1500",
                        "dept_abv": "COGST",
                        "course_title": "Introduction to Environmental Psychology",
                        "course_desc": "Environmental Psychology is an interdisciplinary field concerned with how the physical environment and human behavior interrelate. Most of the course focuses on how residential environments and urban and natural settings affect human health and well-being. Students also examine how human attitudes and behaviors affect environmental quality. Issues of environmental justice and culture are included throughout. Hands-on projects plus exams. Lecture and discussion sections. DEA 1501  - Writing in the major (WIM) option also is available (by instructor permission) for 4 credits.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/COGST/1500'",
                        "semester_taken": "2019SP"
                    },
                    {
                        "course_name": "ENTOM2010",
                        "dept_abv": "ENTOM",
                        "course_title": "Alien Empire: Bizarre Biology of Bugs",
                        "course_desc": "Insects are the most abundant and diverse animals on earth. This course explores the bizarre biology of insects and their interaction with humans. It examines both the detrimental roles insects play (e.g., pests and vectors of disease) as well as their beneficial roles (e.g., pollination, edible insects, insect products such as waxes, dyes, and silk). The course also explores the symbolic representation of insects in art, literature, and religion.",
                        "course_credits": 2.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/ENTOM/2010'",
                        "semester_taken": "2019SP"
                    },
                    {
                        "course_name": "HADM3350",
                        "dept_abv": "HADM",
                        "course_title": "Restaurant Management",
                        "course_desc": "This course covers concepts, issues, and business principles relevant to the restaurant industry, including market analysis, menu and service systems, and financial and operational management and applies them in a real-life restaurant setting. Students conceptualize and manage the operations of an in-person restaurant open to the Cornell community and evaluate the process and outcomes.  Successful completion of the course requires students to complete TiPS and ServSafe certifications shortly after the start of the semester.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/HADM/3350'",
                        "semester_taken": "2019SP"
                    },
                    {
                        "course_name": "PE1425",
                        "dept_abv": "PE",
                        "course_title": "Chi Gong for Stress Reduction and Well Being",
                        "course_desc": "Chi Gong is an ancient Chinese practice meaning exercise with your vital energy or breathing exercise. Although this course is not being taught as a martial art, it can be considered the grandmother of the many different martial arts forms. You will learn Tai Chi Chi Gong Exercises Eighteen Ways. This form focuses on relaxation and rejuvenation through slow, graceful movements.  You will coordinate breathing, body position and mental activity. You will also learn passive Chi Gong/meditation, explore healing sounds, and self-massage. Benefits of practice include stress reduction, strength and balance, and inner harmony. In just moments of practice each day you can learn to shift your mental and physical state.  Practice is done in any comfortable clothing.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/PE/1425'",
                        "semester_taken": "2019SP"
                    }
                ]
            }
        },
        {
            "pathway_id": "6add1d5a38ea311b5a62e715d7e773e7bd411aaa25fa4610d6c80d439f7637ec",
            "courses": {
                "1": [
                    {
                        "course_name": "ILRLR3300",
                        "dept_abv": "ILRLR",
                        "course_title": "Advocacy and Debate",
                        "course_desc": "Students learn the principles of argumentation and debate. Topics emphasize Internet database research, synthesis of collected data, policy analysis, evidentiary quality, refutation of counter claims, identification of logical fallacies, risk evaluation, framing of issues, and coherent storytelling. Prepares students to work with a great range of opinion and evidence. Emphasizes different viewpoints, including those of different cultures. Assumptions are interrogated.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ILRLR/3300'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "PE1430",
                        "dept_abv": "PE",
                        "course_title": "Introduction to Yoga",
                        "course_desc": "Learn the alignment foundations of yoga while building strength, flexibility, and vitality! This class is for those who are new to yoga or those looking to fine tune their practice. Students will learn the \"ins and outs\" of a variety of standing poses, back bends, and maybe even a few inversions or arm balances! Modifications will be given to accommodate all levels. Each class will also include breath instruction and poses for stress reduction. ",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/PE/1430'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "NTRES1101",
                        "dept_abv": "SNES",
                        "course_title": "Introduction to Environmental Science and Sustainability",
                        "course_desc": "This course examines the depth and breadth of environmental science, focusing on principles from the physical and biological sciences that -- integrated with insights from the social sciences -- can help us understand environmental change and improve resource management.  Case studies, readings, discussions, and field and laboratory exercises focus on developing an interdisciplinary foundation for understanding how biophysical systems influence and are influenced by social processes.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA14/class/SNES/1101'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "MATH1110",
                        "dept_abv": "MATH",
                        "course_title": "Calculus I",
                        "course_desc": "Topics include functions and graphs, limits and continuity, differentiation and integration of algebraic, trigonometric, inverse trig, logarithmic, and exponential functions; applications of differentiation, including graphing, max-min problems, tangent line approximation, implicit differentiation, and applications to the sciences; the mean value theorem; and antiderivatives, definite and indefinite integrals, the fundamental theorem of calculus, substitution in integration, the area under a curve. Graphing calculators are used, and their pitfalls are discussed, as applicable to the above topics.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/MATH/1110'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "MEDVL1101",
                        "dept_abv": "MEDVL",
                        "course_title": "FWS: Aspects of Medieval Culture",
                        "course_desc": "na",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/MEDVL/1101'",
                        "semester_taken": "2016FA"
                    },
                    {
                        "course_name": "AEM2550",
                        "dept_abv": "AEM",
                        "course_title": "Corporate Sustainability: Business in a Resource-Constrained World",
                        "course_desc": "This course is intended to introduce students to the topic of corporate sustainability and to the risks and opportunities faced by large corporations operating in a resource-constrained world, with a particular focus on the financial  services industry. The course will illustrate the principles of corporate sustainability while highlighting the practical challenges faced by practitioners in large corporate entities today, and will seek to develop in students the ability to recognize and assess sustainability risks and opportunities in the business world. Topics to be covered include: environmental and social impacts of corporate activity; environmental and social risk management; stakeholder engagement and the influence of civil society on corporate behavior; industry responses to sustainability challenges; business opportunities created by resource limitations; environmental finance and impact investing.",
                        "course_credits": 1.5,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA18/class/AEM/2550'",
                        "semester_taken": "2016FA"
                    }
                ],
                "2": [
                    {
                        "course_name": "PE1626",
                        "dept_abv": "PE",
                        "course_title": "Wilderness First Responder",
                        "course_desc": "This 8-day, 80-hour course, provides the prerequisite training and certification necessary for employment as a professional outdoor instructor at nationally recognized programs such as NOLS and Outward Bound. The curriculum goes beyond the basics needed for first aid certification to emphasize the skills and knowledge needed in backcountry rescue situations when extended care may be needed.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/PE/1626'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "ECON1110",
                        "dept_abv": "ECON",
                        "course_title": "Introductory Microeconomics",
                        "course_desc": "Explanation and evaluation of how the price system operates in determining what goods are produced, how goods are produced, who receives income, and how the price system is modified and influenced by private organizations and government policy.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ECON/1110'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "ECON1120",
                        "dept_abv": "ECON",
                        "course_title": "Introductory Macroeconomics",
                        "course_desc": "Analysis of aggregate economic activity in relation to the level, stability, and growth of national income. Topics may include the determination and effects of unemployment, inflation, balance of payments, deficits, and economic development, and how these may be influenced by monetary, fiscal, and other policies.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/ECON/1120'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "ALS2000",
                        "dept_abv": "ALS",
                        "course_title": "Leadership for Sustainability",
                        "course_desc": "This course is for students who are interested in becoming leaders for sustainability while on campus and throughout their lives. It is open to all levels. Students will focus primarily on sustainability issues in residence halls but opportunities to address similar issues across campus and/or in the community are also available. In the fall semester the focus is on reducing waste. During the spring semester emphasis is on reducing energy use and the risks associated with a changing climate. Students will increase their leadership and communication skills and better understand how to motivate themselves and others to change behaviors that will improve our stewardship of the world around us.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP19/class/ALS/2000'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "BEE2000",
                        "dept_abv": "BEE",
                        "course_title": "Perspectives on the Climate Change Challenge Discussion",
                        "course_desc": "This course serves as a rigorous extension of the weekly undergraduate seminar course, (BEE 2000). BEE 2010 adds six additional learning activities in and outside of an additional 75-minute class period Wednesdays, to explore in greater depth the subject matter covered in the seminars. No specific background is assumed for students, as long as they are willing to learn across disciplines.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/BEE/2010'",
                        "semester_taken": "2017SP"
                    },
                    {
                        "course_name": "CHEM1570",
                        "dept_abv": "CHEM",
                        "course_title": "Introduction to Organic and Biological Chemistry",
                        "course_desc": "Introduction to organic chemistry with emphasis on structure, reactivity, and mechanisms of carbon compounds relevant to the life sciences.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/CHEM/1570'",
                        "semester_taken": "2017SP"
                    }
                ],
                "3": [
                    {
                        "course_name": "BIOEE1540",
                        "dept_abv": "BIOEE",
                        "course_title": "Introductory Oceanography",
                        "course_desc": "This class relies more on intuitive reasoning rather than complicated mathematical formulas to convey basic concepts about how the ocean works. For this reason, the class is very accessible to non-science majors. The class covers standard material about how the ocean works, but also includes current environmental threats facing the ocean such as global warming, ocean acidification, overfishing and coastal pollution. Students will gain a depth of knowledge about the ocean and global warming to enable them to speak and write confidently about contemporary public issues regarding the health of the ocean, global warming and a sustainable future. This course satisfies the Physical and Biological Sciences (PBS) requirement for students in most colleges. For students in A&amp;S and CALS, this course counts as \"in-college\" credit.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/BIOEE/1540'",
                        "semester_taken": "2018FA"
                    },
                    {
                        "course_name": "AEM2200",
                        "dept_abv": "AEM",
                        "course_title": "Business Management and Organization",
                        "course_desc": "Foundational course, meant to familiarize students with the use of core concepts in marketing, accounting, organizational design and management, entrepreneurship and strategy, teamwork, leadership, and ethics; as well as with the Dyson/AEM major and the business careers that may follow it. Significant writing and analytical components (both individual and team based case study analysis, evaluation of a U.S. publicly traded corporation).",
                        "course_credits": 4.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/2200'",
                        "semester_taken": "2018FA"
                    },
                    {
                        "course_name": "AEM2600",
                        "dept_abv": "AEM",
                        "course_title": "Managerial Economics",
                        "course_desc": "This course covers microeconomic principles that inform managerial decisions in firms and organizations. The course will touch on how these principles apply to the Dyson School research foci of management, agribusiness, environmental sustainability, and emerging markets.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/2600'",
                        "semester_taken": "2018FA"
                    },
                    {
                        "course_name": "AEM2700",
                        "dept_abv": "AEM",
                        "course_title": "Management Communication",
                        "course_desc": "Management Communication is intended to help you think strategically about communication and aid you in improving your writing, presentation, and interpersonal communication skills as a future manager. We will look at a set of \"best practices\" or guidelines that have been derived from both research and experience, give you the opportunity to put those guidelines into practice, and provide you with feedback on your work to help you strengthen your abilities. More often than not, we will be using a workshop format that will rely heavily on discussion and in-class exercises.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/2700'",
                        "semester_taken": "2018FA"
                    }
                ],
                "4": [
                    {
                        "course_name": "AEM3080",
                        "dept_abv": "AEM",
                        "course_title": "Ethical Issues in Business Management and Organizations",
                        "course_desc": "This course offers an overview of ethics-related issues, dilemmas, and potential solutions in business and management. Topics include the difference between market economy and market society; differences between bureaucracies, law, and ethics; the stakeholder paradigm; triple bottom line; social responsibility; organizational culture; and personal growth.",
                        "course_credits": 2.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP19/class/AEM/3080'",
                        "semester_taken": "2019SP"
                    },
                    {
                        "course_name": "AEM2010",
                        "dept_abv": "AEM",
                        "course_title": "Spreadsheet Modeling for Management and Economics",
                        "course_desc": "This course will be developed as a data-driven, model-based approach to decision-making. Most applications will rely on the standard array of Excel functionality but other platforms (e.g., Access, SQL, presentation software) may be employed. A unique feature of this course will be applications drawn from the diverse program areas of the Dyson School: management; international development/trade; environment/resource economics; and food/agricultural economics. Case material will be contributed by the companies from the DUAC. Key topics will include: Optimization (Solver), Data graphing, Financial modeling, Ethical/social dimensions of IT, Forecasting, Pivot tables, Exponential smoothing, and Simulation.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/2010'",
                        "semester_taken": "2019SP"
                    },
                    {
                        "course_name": "AEM2015",
                        "dept_abv": "AEM",
                        "course_title": "The Business Case for Diversity and Inclusion",
                        "course_desc": "Diversity is everywhere. But research and experience show diversity alone does not produce better results. To reap the benefits of diversity, organizational leaders must understand and be prepared to address the challenges of our diverse, interconnected world. One academically proven way to maximize the benefits differences bring to organizations is to combine diversity with cultural intelligence (CQ), the capability to relate and work effectively in culturally diverse situations. This course is designed to cultivate a theoretical and practical understanding and application of the business case for diversity and inclusion, and help develop cultural intelligence for working successfully in today's diverse, globalized reality. This course combines conceptual and experiential approaches to diversity and inclusion in organizations through exercises, case studies, discussions, readings, videos, guest speakers, and group work.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/2015'",
                        "semester_taken": "2019SP"
                    },
                    {
                        "course_name": "AEM2420",
                        "dept_abv": "AEM",
                        "course_title": "Marketing for Dyson Majors",
                        "course_desc": "Provides a broad introduction to the fundamentals of marketing. Explores the components of an organization's strategic marketing program, including how to price, promote, and distribute goods and services. Industry guest lectures and current marketing applications from various companies are presented and analyzed. Students will complete a marketing plan.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/2420'",
                        "semester_taken": "2019SP"
                    },
                    {
                        "course_name": "AEM2601",
                        "dept_abv": "AEM",
                        "course_title": "Strategy",
                        "course_desc": "This course analyzes the sources of firms' competitive advantage and develops the knowledge and skills necessary to be an effective strategy analyst. The course is grounded in microeconomic concepts taught in AEM 2600 in terms of discipline, and draws from corporate finance, marketing, human resource management and organization science. This course uses both lecture, discussion and case studies to encourage students to develop skills in formulating strategy in a practical context.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/2601'",
                        "semester_taken": "2019SP"
                    }
                ],
                "5": [
                    {
                        "course_name": "NBA5360",
                        "dept_abv": "NBA",
                        "course_title": "Investment Banking Essentials",
                        "course_desc": "This course will help students learn how to be investment bankers. Taught by an experienced ex-banker on the faculty of Johnson, this class will introduce students to capital raising, LBO, and strategic M&amp;A transactions in a hands-on way that will focus on how to perform IB analyst-level duties. Students will be introduced to valuation (comps, precedents, and DCF), accretion/dilution, and how to assemble a pitch book. Working in groups, students will be presented with real-world assignments and will present their work in class. No prelim or final exam.",
                        "course_credits": 1.5,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/NBA/5360'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "AEM2240",
                        "dept_abv": "AEM",
                        "course_title": "Finance for Dyson Majors",
                        "course_desc": "Focuses on the mathematics of finance, valuation, and the economics of managerial decisions, corporate financial policy, risk management, and investments. Topics include the time value of money, bond and stock valuation, capital-budgeting decisions, financing alternatives, the cost of capital and the capital-structure decision, distribution policy, mergers and acquisitions and restructuring, options, forward and futures contracts, market efficiency and market anomalies, strategies of successful investors, and personal finance.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/2240'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "AEM3200",
                        "dept_abv": "AEM",
                        "course_title": "Business Law",
                        "course_desc": "Examines legal problems of particular interest to persons who expect to engage in business. Emphasizes the law of contracts, sales, agency, and property.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/3200'",
                        "semester_taken": "2019FA"
                    },
                    {
                        "course_name": "PE1320",
                        "dept_abv": "PE",
                        "course_title": "Professional Instructional Golf",
                        "course_desc": "Equipment furnished. PGA program of instruction geared to all levels of experience and ability. The objective is to give beginners enough skill to play, and to give more advanced players direction in their thinking, practice, and play, through a thorough understanding of fundamentals.",
                        "course_credits": 1.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/PE/1320'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "AEM4570",
                        "dept_abv": "AEM",
                        "course_title": "Corporate Finance",
                        "course_desc": "This course is designed to advance the understanding of corporate financial decision making. The class will further the corporate finance topics taught in AEM 2240 such cost of capital, capital structure, mergers and acquisitions, and dividend policy. Some topics in international corporate finance topics will also be discussed.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/4570'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "AEM2800",
                        "dept_abv": "AEM",
                        "course_title": "Hot Economic Issues in the News Today",
                        "course_desc": "This course is a writing in the disciplines course in current economic issues. It is intended as a topical course focusing on selected issues that are important to the national debate. The basic analysis taught in ECON 1110 and ECON 1120 is taken as the point of departure and is used to illuminate these issues.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/2800'",
                        "semester_taken": "2019FA"
                    },
                    {
                        "course_name": "PLPPM2010",
                        "dept_abv": "PLPPM",
                        "course_title": "Mushrooms, Molds, and Molecules",
                        "course_desc": "PLPA 2015 is a three-credit course, in two parts. The one-credit Mushrooms, Molds, and Molecules portion of the course is offered in partnership with the two-credit Magical Mushrooms, Mischievous Molds, PLPPM 2010, portion of the course offered by Professor Kathie Hodge. Students in Mushrooms, Molds and Molecules participate in a weekly 50-minute lecture/discussion section which provides in-depth exposure to some of the issues raised in the Magical Mushrooms, Michievous Molds lectures. In Mushrooms, Molds, and Molecules, experts emphasize that fungi produce myriads of molecules that are beneficial to other organisms (e.g., antibiotics, immune-suppressants, biocontrol agents) or to themselves (e.g. for communication, development, reproduction, nutrient gathering, stress reduction), or detrimental to other organisms (e.g. toxins, poisons, allergens, hallucinogens). Although this course will be more in-depth than Magical Mushrooms, Mishievous Molds, it does not assume a scientific background, and there are no prerequisites. Testing and other course requirements for Mushrooms, Molds and Molecules are in addition to those for Magical Mushrooms, Mischievous Molds, although there is only one final grade.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP16/class/PLPPM/2015'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "AEM2225",
                        "dept_abv": "AEM",
                        "course_title": "Financial Accounting For Dyson Majors",
                        "course_desc": "Comprehensive introduction to financial accounting concepts and applications. Focuses primarily on recording and communicating financial information for use by external users such as investors, creditors and regulators, and is intended to provide a basic understanding of the accounting cycle, elements of financial statements, Generally Accepted Accounting Principles, and financial statement interpretation. Topics include accounting for inventory, receivables, depreciation, bonds, equity, and cash flows.",
                        "course_credits": 4.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/2225'",
                        "semester_taken": "2019FA"
                    },
                    {
                        "course_name": "NBA5110",
                        "dept_abv": "NBA",
                        "course_title": "Financial Modeling",
                        "course_desc": "Financial modeling is the art and science of constructing spreadsheet models of firms' future financial statements. This class draws on and integrates students' knowledge of concepts learned in prior accounting classes by modeling the effect on the income statement, balance sheet, and statement of cash flows of financial transactions such as leveraged buyouts, mergers and acquisitions, and corporate reorganizations. The class meets in the state-of-the-art Parker Center computer lab, and active student participation is emphasized.",
                        "course_credits": 1.5,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/NBA/5110'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "AEM4010",
                        "dept_abv": "AEM",
                        "course_title": "Organizational Analytics",
                        "course_desc": "This course takes an analytics based approach to managerial decision making within a spreadsheet platform. Through case analysis, emphasis will be placed on the exploration and application of Microsoft Excel to enhance decision making and improve outcomes. This data-driven course will require students to leverage complex functionality available in the Excel platform. Key mechanics employed will be: advanced methods of data management, data visualization, financial modeling, forecasting, optimization, pivot tables, and simulation. Key topics covered could be, but are not limited to areas such as employee productivity, succession planning, organizational safety, employee satisfaction, team dynamics, leadership, Just-in-Time inventory, recruitment and selection, training and engagement.",
                        "course_credits": 1.5,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP20/class/AEM/4010'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "AEM3520",
                        "dept_abv": "AEM",
                        "course_title": "Financial Statements Analysis",
                        "course_desc": "The course will focus on developing a framework for analyzing financial statements to make business decisions. The framework is intended to enhance the ability to qualitatively and quantitatively assess financial information. Goals of the course include learning to read financial statements for relevant information, understanding the impact of a business' accounting choices and estimates, analyzing financial ratios and cash flow measures and methods for valuation of a business. Cases are incorporated in class discussions and assignments in order to illustrate concepts and allow students to put into practice the tools presented.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/3520'",
                        "semester_taken": "2020SP"
                    },
                    {
                        "course_name": "AEM4620",
                        "dept_abv": "AEM",
                        "course_title": "Advanced Financial Modeling and Analysis",
                        "course_desc": "Focuses on issues involving technology and financial markets. It is designed to equip future finance professionals with the knowledge of key finance systems (Bloomberg) skills and technologies. The lectures and labs teach students to apply their theoretical finance knowledge in real-world situations for the purpose of optimizing their future job performance and increase their marketability. Lectures explore topics on the effects of technology on financial markets. The lab component requires students to complete the 30-hour, self-paced Bloomberg certification process.",
                        "course_credits": 2.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/4620'",
                        "semester_taken": "2019FA"
                    }
                ],
                "7": [
                    {
                        "course_name": "AEM2840",
                        "dept_abv": "AEM",
                        "course_title": "Python Programming for Data Analysis and Business Modeling",
                        "course_desc": "This course is an introduction to programming with Python for students aiming to enter the world of business analytics. Using business applied cases students will increase decision making efficiency and productivity through a detailed understanding of Python programming languages. Students will also learn how to use a range of Python libraries for data analytics such as NumPy, MatPlotLib, Seaborn, Pandas, and Scikit.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/2840'",
                        "semester_taken": "2020FA"
                    },
                    {
                        "course_name": "AIIS1100",
                        "dept_abv": "ANTHR",
                        "course_title": "Indigenous North America",
                        "course_desc": "This course provides an interdisciplinary introduction to the diverse cultures, histories and contemporary situations of the Indigenous peoples of North America. Students will also be introduced to important themes in the post-1492 engagement between Indigenous and settler populations in North America and will consider the various and complex ways in which that history affected - and continues to affect - American Indian peoples and societies. Course materials draw on the humanities, social sciences, and expressive arts.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA19/class/ANTHR/1700'",
                        "semester_taken": "2020FA"
                    },
                    {
                        "course_name": "AEM3310",
                        "dept_abv": "AEM",
                        "course_title": "Introduction to Business Regulation",
                        "course_desc": "The purpose of this course is to help and guide business and policy students in understanding and recognizing the multiple\nmotivations of society to control certain business activities, the several general approaches to regulation and what is understood of\nthe outcomes, and to provide an appreciation through case studies of how different sectors manage in a regulated environment. The\ntreatment is to include an evaluation of the concept of 'regulatory risk', the uncertainly about regulatory outcomes/changes which\nconstitute a risk, the major risk in some industries, so that understanding and managing that risk is a significant aspect of\nprofitability for many firms, and a consideration for policy makers. Specific emphasis will be placed on the healthcare,\nbiotechnology, energy, and technology business sectors.",
                        "course_credits": 3.0,
                        "course_semesters": "'Fall'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/FA20/class/AEM/3310'",
                        "semester_taken": "2020FA"
                    },
                    {
                        "course_name": "AEM4670",
                        "dept_abv": "AEM",
                        "course_title": "Investments",
                        "course_desc": "This course is designed to further the understanding of institutional investment management. The course covers key concepts in risk return trade-offs and asset allocation. Students are expected to implement various techniques using real world data. The course also covers select topics in portfolio risk management and current regulatory adjustments.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/4670'",
                        "semester_taken": "2020FA"
                    }
                ],
                "8": [
                    {
                        "course_name": "BIOEE1610",
                        "dept_abv": "BIOEE",
                        "course_title": "Introductory Biology: Ecology and the Environment",
                        "course_desc": "This course provides an introduction to ecology, covering interactions between organisms and the environment at scales of populations, communities, and ecosystems. Ecological principles are used to explore the theory and applications of major issues facing humanity in the 21st century, including population dynamics, disease ecology, biodiversity and invasive species, global change, and other topics of environmental sustainability.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/BIOEE/1610'",
                        "semester_taken": "2021SP"
                    },
                    {
                        "course_name": "AEM3230",
                        "dept_abv": "AEM",
                        "course_title": "Managerial Accounting",
                        "course_desc": "This course provides an introduction to the basic concepts, analyses, uses, and procedures of accounting and control used by internal company managers when they are faced with planning, directing, controlling, and decision-making activities in their organization. Topics covered focus on the relationship between strategy and decision-making and include product and service costing, budget setting, decision-making, profitability analysis, pricing, investment analysis, management control systems, and performance measurement.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/3230'",
                        "semester_taken": "2021SP"
                    },
                    {
                        "course_name": "AEM2300",
                        "dept_abv": "AEM",
                        "course_title": "International Trade and Finance",
                        "course_desc": "One-semester introduction to international economic principles and issues. Begins by surveying key topics such as the elements of comparative advantage, tariff and nontariff barriers, and multilateral institutions. The second part of the course treats selected topics in international finance, including exchange rates, balance of payments, and capital markets. Discusses current issues such as the effects of trade liberalization, trade and economic growth, and instability in international capital markets. Designed as a less technical introduction to concepts developed at a more advanced level in AEM 4300 and ECON 4510-ECON 4520.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/2300'",
                        "semester_taken": "2021SP"
                    },
                    {
                        "course_name": "AEM4280",
                        "dept_abv": "AEM",
                        "course_title": "Valuation of Capital Investment",
                        "course_desc": "This course is about the analysis of financial information for making decisions to invest in businesses. The primary focus is on quantitative stock selection and equity (share) valuation. Various valuation models will be examined in detail and applied in cases and projects involving listed companies. First, the issue of market efficiency will be explored. Second, important quantitative stock selection methods will be examined. Third, discounted cash flow models will be examined. This include models of shareholder value, the analysis of profitability, growth and valuation generation in a firm, forecasting earnings and cash flows, pro-forma analysis for strategy and planning, analysis of risk, and the determination of price/earnings and market-to-book ratios. Advanced topics on valuation including valuation by multiples and earnings management will then be discussed.",
                        "course_credits": 3.0,
                        "course_semesters": "'Spring'",
                        "roster_links": "'https://classes.cornell.edu/browse/roster/SP21/class/AEM/4280'",
                        "semester_taken": "2021SP"
                    }
                ]
            }
        }
    ]
}